HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief HICK Auto Clock Calibration
  */

typedef struct
{
  __IO uint32_t STS;      /*!< ACC Status register,                         Address offset: 0x00 */
  __IO uint32_t CTRL1;    /*!< ACC Control register 1,                      Address offset: 0x04 */
  __IO uint32_t CTRL2;    /*!< ACC Control register 2,                      Address offset: 0x08 */
  __IO uint32_t CP1;      /*!< ACC Compare value 1,                         Address offset: 0x0C */
  __IO uint32_t CP2;      /*!< ACC Compare value 2,                         Address offset: 0x10 */
  __IO uint32_t CP3;      /*!< ACC Compare value 3,                         Address offset: 0x14 */
} ACC_TypeDef;

/**
  * @brief Analog to Digital Converter
  */

typedef struct
{
  __IO uint32_t STS;             /*!< ADC status register,                         Address offset: 0x00 */
  __IO uint32_t CTRL1;           /*!< ADC control register 1,                      Address offset: 0x04 */
  __IO uint32_t CTRL2;           /*!< ADC control register 2,                      Address offset: 0x08 */
  __IO uint32_t SPT1;            /*!< ADC sampling time register 1,                Address offset: 0x0C */
  __IO uint32_t SPT2;            /*!< ADC sampling time register 2,                Address offset: 0x10 */
  __IO uint32_t PCDTO1;          /*!< ADC preempted channel data offset reg 1,     Address offset: 0x14 */
  __IO uint32_t PCDTO2;          /*!< ADC preempted channel data offset reg 2,     Address offset: 0x18 */
  __IO uint32_t PCDTO3;          /*!< ADC preempted channel data offset reg 3      Address offset: 0x1C */
  __IO uint32_t PCDTO4;          /*!< ADC preempted channel data offset reg 4      Address offset: 0x20 */
  __IO uint32_t VMHB;            /*!< ADC voltage monitor high threshold register, Address offset: 0x24 */
  __IO uint32_t VMLB;            /*!< ADC voltage monitor low threshold register,  Address offset: 0x28 */
  __IO uint32_t OSQ1;            /*!< ADC ordinary sequence register 1,            Address offset: 0x2C */
  __IO uint32_t OSQ2;            /*!< ADC ordinary sequence register 2,            Address offset: 0x30 */
  __IO uint32_t OSQ3;            /*!< ADC ordinary sequence register 3,            Address offset: 0x34 */
  __IO uint32_t PSQ;             /*!< ADC preempted sequence register,             Address offset: 0x38 */
  __IO uint32_t PDT1;            /*!< ADC preempted data register 1,               Address offset: 0x3C */
  __IO uint32_t PDT2;            /*!< ADC preempted data register 2,               Address offset: 0x40 */
  __IO uint32_t PDT3;            /*!< ADC preempted data register 3,               Address offset: 0x44 */
  __IO uint32_t PDT4;            /*!< ADC preempted data register 4,               Address offset: 0x48 */
  __IO uint32_t ODT;             /*!< ADC ordinary data register,                  Address offset: 0x4C */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t STS;             /*!< ADC status register,    used for ADC multimode (bits common to several ADC instances). Address offset: ADC1 base address        */
  __IO uint32_t CTRL1;           /*!< ADC control register 1, used for ADC multimode (bits common to several ADC instances). Address offset: ADC1 base address + 0x04 */
  __IO uint32_t CTRL2;           /*!< ADC control register 2, used for ADC multimode (bits common to several ADC instances). Address offset: ADC1 base address + 0x08 */
  uint32_t      RESERVED[16];    /*!< Reserved                                                                                                                        */
  __IO uint32_t ODT;             /*!< ADC data register,      used for ADC multimode (bits common to several ADC instances). Address offset: ADC1 base address + 0x4C */
} ADC_Common_TypeDef;

/**
  * @brief Battery Powered Registers
  */

typedef struct
{
  uint32_t      RESERVED0;    /*!< Reserved,                                    Address offset: 0x00 */
  __IO uint32_t DT1;          /*!< BPR Battery powered data register 1,         Address offset: 0x04 */
  __IO uint32_t DT2;          /*!< BPR Battery powered data register 2,         Address offset: 0x08 */
  __IO uint32_t DT3;          /*!< BPR Battery powered data register 3,         Address offset: 0x0C */
  __IO uint32_t DT4;          /*!< BPR Battery powered data register 4,         Address offset: 0x10 */
  __IO uint32_t DT5;          /*!< BPR Battery powered data register 5,         Address offset: 0x14 */
  __IO uint32_t DT6;          /*!< BPR Battery powered data register 6,         Address offset: 0x18 */
  __IO uint32_t DT7;          /*!< BPR Battery powered data register 7,         Address offset: 0x1C */
  __IO uint32_t DT8;          /*!< BPR Battery powered data register 8,         Address offset: 0x20 */
  __IO uint32_t DT9;          /*!< BPR Battery powered data register 9,         Address offset: 0x24 */
  __IO uint32_t DT10;         /*!< BPR Battery powered data register 10,        Address offset: 0x28 */
  __IO uint32_t RTCCAL;       /*!< BPR RTC calibration register,                Address offset: 0x2C */
  __IO uint32_t CTRL;         /*!< BPR control register,                        Address offset: 0x30 */
  __IO uint32_t CTRLSTS;      /*!< BPR control/status register,                 Address offset: 0x34 */
  uint32_t      RESERVED1;    /*!< Reserved,                                    Address offset: 0x38 */
  uint32_t      RESERVED2;    /*!< Reserved,                                    Address offset: 0x3C */
  __IO uint32_t DT11;         /*!< BPR Battery powered data register 11,        Address offset: 0x40 */
  __IO uint32_t DT12;         /*!< BPR Battery powered data register 12,        Address offset: 0x44 */
  __IO uint32_t DT13;         /*!< BPR Battery powered data register 13,        Address offset: 0x48 */
  __IO uint32_t DT14;         /*!< BPR Battery powered data register 14,        Address offset: 0x4C */
  __IO uint32_t DT15;         /*!< BPR Battery powered data register 15,        Address offset: 0x50 */
  __IO uint32_t DT16;         /*!< BPR Battery powered data register 16,        Address offset: 0x54 */
  __IO uint32_t DT17;         /*!< BPR Battery powered data register 17,        Address offset: 0x58 */
  __IO uint32_t DT18;         /*!< BPR Battery powered data register 18,        Address offset: 0x5C */
  __IO uint32_t DT19;         /*!< BPR Battery powered data register 19,        Address offset: 0x60 */
  __IO uint32_t DT20;         /*!< BPR Battery powered data register 20,        Address offset: 0x64 */
  __IO uint32_t DT21;         /*!< BPR Battery powered data register 21,        Address offset: 0x68 */
  __IO uint32_t DT22;         /*!< BPR Battery powered data register 22,        Address offset: 0x6C */
  __IO uint32_t DT23;         /*!< BPR Battery powered data register 23,        Address offset: 0x70 */
  __IO uint32_t DT24;         /*!< BPR Battery powered data register 24,        Address offset: 0x74 */
  __IO uint32_t DT25;         /*!< BPR Battery powered data register 25,        Address offset: 0x78 */
  __IO uint32_t DT26;         /*!< BPR Battery powered data register 26,        Address offset: 0x7C */
  __IO uint32_t DT27;         /*!< BPR Battery powered data register 27,        Address offset: 0x80 */
  __IO uint32_t DT28;         /*!< BPR Battery powered data register 28,        Address offset: 0x84 */
  __IO uint32_t DT29;         /*!< BPR Battery powered data register 29,        Address offset: 0x88 */
  __IO uint32_t DT30;         /*!< BPR Battery powered data register 30,        Address offset: 0x8C */
  __IO uint32_t DT31;         /*!< BPR Battery powered data register 31,        Address offset: 0x90 */
  __IO uint32_t DT32;         /*!< BPR Battery powered data register 32,        Address offset: 0x94 */
  __IO uint32_t DT33;         /*!< BPR Battery powered data register 33,        Address offset: 0x98 */
  __IO uint32_t DT34;         /*!< BPR Battery powered data register 34,        Address offset: 0x9C */
  __IO uint32_t DT35;         /*!< BPR Battery powered data register 35,        Address offset: 0xA0 */
  __IO uint32_t DT36;         /*!< BPR Battery powered data register 36,        Address offset: 0xA4 */
  __IO uint32_t DT37;         /*!< BPR Battery powered data register 37,        Address offset: 0xA8 */
  __IO uint32_t DT38;         /*!< BPR Battery powered data register 38,        Address offset: 0xAC */
  __IO uint32_t DT39;         /*!< BPR Battery powered data register 39,        Address offset: 0xB0 */
  __IO uint32_t DT40;         /*!< BPR Battery powered data register 40,        Address offset: 0xB4 */
  __IO uint32_t DT41;         /*!< BPR Battery powered data register 41,        Address offset: 0xB8 */
  __IO uint32_t DT42;         /*!< BPR Battery powered data register 42,        Address offset: 0xBC */
} BPR_TypeDef;

/**
  * @brief Controller Area Network TX Mailbox Registers
  */

typedef struct
{
  __IO uint32_t TMI;
  __IO uint32_t TMC;
  __IO uint32_t TMDTL;
  __IO uint32_t TMDTH;
} CAN_TxMailBox_TypeDef;

/**
  * @brief Controller Area Network FIFO Mailbox Registers
  */

typedef struct
{
  __IO uint32_t RFI;
  __IO uint32_t RFC;
  __IO uint32_t RFDTL;
  __IO uint32_t RFDTH;
} CAN_FIFOMailBox_TypeDef;

/**
  * @brief Controller Area Network Filter Registers
  */

typedef struct
{
  __IO uint32_t FFB1;
  __IO uint32_t FFB2;
} CAN_FilterRegister_TypeDef;

/**
  * @brief Controller Area Network
  */

typedef struct
{
  __IO uint32_t MCTRL;                               /*!< CAN master control register,                 Address offset: 0x000         */
  __IO uint32_t MSTS;                                /*!< CAN master status register,                  Address offset: 0x004         */
  __IO uint32_t TSTS;                                /*!< CAN transmit status register,                Address offset: 0x008         */
  __IO uint32_t RF0;                                 /*!< CAN receive FIFO 0 register,                 Address offset: 0x00C         */
  __IO uint32_t RF1;                                 /*!< CAN receive FIFO 1 register,                 Address offset: 0x010         */
  __IO uint32_t INTEN;                               /*!< CAN interrupt enable register,               Address offset: 0x014         */
  __IO uint32_t ESTS;                                /*!< CAN error status register,                   Address offset: 0x018         */
  __IO uint32_t BTMG;                                /*!< CAN bit timing register,                     Address offset: 0x01C         */
  uint32_t      RESERVED0[88];                       /*!< Reserved,                                    Address offset: 0x020 ~ 0x17F */
  CAN_TxMailBox_TypeDef sTxMailBox[3];               /*!< CAN TX Mailbox registers,                    Address offset: 0x180 ~ 0x1AC */
  CAN_FIFOMailBox_TypeDef sFIFOMailBox[2];           /*!< CAN FIFO Mailbox registers,                  Address offset: 0x1B0 ~ 0x1CC */
  uint32_t      RESERVED1[12];                       /*!< Reserved,                                    Address offset: 0x1D0 ~ 0x1FF */
  __IO uint32_t FCTRL;                               /*!< CAN filter control register,                 Address offset: 0x200         */
  __IO uint32_t FMCFG;                               /*!< CAN filter mode configuration register,      Address offset: 0x204         */
  uint32_t      RESERVED2;                           /*!< Reserved,                                    Address offset: 0x208         */
  __IO uint32_t FBWCFG;                              /*!< CAN filter bit width configuration register, Address offset: 0x20C         */
  uint32_t      RESERVED3;                           /*!< Reserved,                                    Address offset: 0x210         */
  __IO uint32_t FRF;                                 /*!< CAN filter FIFO association register,        Address offset: 0x214         */
  uint32_t      RESERVED4;                           /*!< Reserved,                                    Address offset: 0x218         */
  __IO uint32_t FACFG;                               /*!< CAN filter activation control register,      Address offset: 0x21C         */
  uint32_t      RESERVED5[8];                        /*!< Reserved,                                    Address offset: 0x220 ~ 0x23F */
  CAN_FilterRegister_TypeDef sFilterRegister[14];    /*!< CAN filter registers,                        Address offset: 0x240 ~ 0x2AC */
} CAN_TypeDef;

/**
  * @brief CRC calculation unit
  */

typedef struct
{
  __IO uint32_t DT;           /*!< CRC Data register,                           Address offset: 0x00 */
  __IO uint32_t CDT;          /*!< CRC Common data register,                    Address offset: 0x04 */
  __IO uint32_t CTRL;         /*!< CRC Control register,                        Address offset: 0x08 */
  uint32_t      RESERVED;     /*!< Reserved,                                    Address offset: 0x0C */
  __IO uint32_t IDT;          /*!< CRC Initialization register,                 Address offset: 0x10 */
} CRC_TypeDef;

/**
  * @brief Clock and Reset Manage
  */

typedef struct
{
  __IO uint32_t CTRL;            /*!< CRM Clock control register,                  Address offset: 0x00        */
  __IO uint32_t CFG;             /*!< CRM Clock configuration register,            Address offset: 0x04        */
  __IO uint32_t CLKINT;          /*!< CRM Clock interrupt register,                Address offset: 0x08        */
  __IO uint32_t APB2RST;         /*!< CRM APB2 peripheral reset register,          Address offset: 0x0C        */
  __IO uint32_t APB1RST;         /*!< CRM APB1 peripheral reset register,          Address offset: 0x10        */
  __IO uint32_t AHBEN;           /*!< CRM APB peripheral clock enable register,    Address offset: 0x14        */
  __IO uint32_t APB2EN;          /*!< CRM APB2 peripheral clock enable register,   Address offset: 0x18        */
  __IO uint32_t APB1EN;          /*!< CRM APB1 peripheral clock enable register,   Address offset: 0x1C        */
  __IO uint32_t BPDC;            /*!< CRM Battery powered domain control register, Address offset: 0x20        */
  __IO uint32_t CTRLSTS;         /*!< CRM Control/status register,                 Address offset: 0x24        */
  uint32_t      RESERVED0;       /*!< Reserved,                                    Address offset: 0x2C        */
  __IO uint32_t MISC1;           /*!< CRM Additional register 1,                   Address offset: 0x30        */
  uint32_t      RESERVED1[7];    /*!< Reserved,                                    Address offset: 0x34 ~ 0x4C */
  __IO uint32_t MISC2;           /*!< CRM Additional register 2,                   Address offset: 0x50        */
  __IO uint32_t MISC3;           /*!< CRM Additional register 3,                   Address offset: 0x54        */
  uint32_t      RESERVED2;       /*!< Reserved,                                    Address offset: 0x58        */
  __IO uint32_t INTMAP;          /*!< CRM Interrupt map register,                  Address offset: 0x5C        */
} CRM_TypeDef;

/**
  * @brief Digital to Analog Converter
  */

typedef struct
{
  __IO uint32_t CTRL;        /*!< DAC control register,                        Address offset: 0x00 */
  __IO uint32_t SWTRG;       /*!< DAC software trigger register,               Address offset: 0x04 */
  __IO uint32_t D1DTH12R;    /*!< DAC1 12-bit right-aligned data holding reg,  Address offset: 0x08 */
  __IO uint32_t D1DTH12L;    /*!< DAC1 12-bit left-aligned data holding reg,   Address offset: 0x0C */
  __IO uint32_t D1DTH8R;     /*!< DAC1 8-bit right-aligned data holding reg,   Address offset: 0x10 */
  __IO uint32_t D2DTH12R;    /*!< DAC2 12-bit right-aligned data holding reg,  Address offset: 0x14 */
  __IO uint32_t D2DTH12L;    /*!< DAC2 12-bit left-aligned data holding reg,   Address offset: 0x18 */
  __IO uint32_t D2DTH8R;     /*!< DAC2 8-bit right-aligned data holding reg,   Address offset: 0x1C */
  __IO uint32_t DDTH12R;     /*!< 2 DAC 12-bit right-aligned data holding reg, Address offset: 0x20 */
  __IO uint32_t DDTH12L;     /*!< 2 DAC 12-bit left-aligned data holding reg,  Address offset: 0x24 */
  __IO uint32_t DDTH8R;      /*!< 2 DAC 8-bit right-aligned data holding reg,  Address offset: 0x28 */
  __IO uint32_t D1ODT;       /*!< DAC1 data output register,                   Address offset: 0x2C */
  __IO uint32_t D2ODT;       /*!< DAC2 data output register,                   Address offset: 0x30 */
} DAC_TypeDef;

/**
  * @brief Debug MCU
  */

typedef struct
{
  __IO uint32_t PID;     /*!< DEBUG device ID,                             Address offset: 0xE004_2000 */
  __IO uint32_t CTRL;    /*!< DEBUG control register,                      Address offset: 0xE004_2004 */
} DEBUG_TypeDef;

/**
  * @brief DMA Controller
  */

typedef struct
{
  __IO uint32_t CCTRL;           /*!< DMA channel x configuration register,        Address offset: 0x08 + 20 * (x - 1) x = 1 ... 7 */
  __IO uint32_t CDTCNT;          /*!< DMA channel x number of data register,       Address offset: 0x0C + 20 * (x - 1) x = 1 ... 7 */
  __IO uint32_t CPADDR;          /*!< DMA channel x peripheral address register,   Address offset: 0x10 + 20 * (x - 1) x = 1 ... 7 */
  __IO uint32_t CMADDR;          /*!< DMA channel x memory address register,       Address offset: 0x14 + 20 * (x - 1) x = 1 ... 7 */
} DMA_Channel_TypeDef;

typedef struct
{
  __IO uint32_t STS;             /*!< DMA interrupt status register,               Address offset: 0x00        */
  __IO uint32_t CLR;             /*!< DMA interrupt flag clear register,           Address offset: 0x04        */
  uint32_t      RESERVED[38];    /*!< Reserved,                                    Address offset: 0x08 ~ 0x9C */
  __IO uint32_t SRC_SEL0;        /*!< DMA Channel source register 0,               Address offset: 0xA0        */
  __IO uint32_t SRC_SEL1;        /*!< DMA Channel source register 1,               Address offset: 0xA4        */
} DMA_TypeDef;

/**
  * @brief External Interrupt/Event Controller
  */

typedef struct
{
  __IO uint32_t INTEN;      /*!< EXINT Interrupt enable register,             Address offset: 0x00 */
  __IO uint32_t EVTEN;      /*!< EXINT Event enable register,                 Address offset: 0x04 */
  __IO uint32_t POLCFG1;    /*!< EXINT Polarity configuration register 1,     Address offset: 0x08 */
  __IO uint32_t POLCFG2;    /*!< EXINT Polarity configuration register 2,     Address offset: 0x0C */
  __IO uint32_t SWTRG;      /*!< EXINT Software trigger register,             Address offset: 0x10 */
  __IO uint32_t INTSTS;     /*!< EXINT Interrupt status register,             Address offset: 0x14 */
} EXINT_TypeDef;

/**
  * @brief Flash Memory Registers
  */

typedef struct
{
  __IO uint32_t PSR;               /*!< FLASH performance select register,           Address offset: 0x00        */
  __IO uint32_t UNLOCK;            /*!< FLASH unlock register 1,                     Address offset: 0x04        */
  __IO uint32_t USD_UNLOCK;        /*!< FLASH user system data unlock register,      Address offset: 0x08        */
  __IO uint32_t STS;               /*!< FLASH status register,                       Address offset: 0x0C        */
  __IO uint32_t CTRL;              /*!< FLASH control register,                      Address offset: 0x10        */
  __IO uint32_t ADDR;              /*!< FLASH address register,                      Address offset: 0x14        */
  uint32_t      RESERVED0;         /*!< Reserved,                                    Address offset: 0x18        */
  __IO uint32_t USD;               /*!< FLASH User system data register,             Address offset: 0x1C        */
  __IO uint32_t EPPS;              /*!< FLASH Erase/program protection status reg,   Address offset: 0x20        */
  uint32_t      RESERVED1[8];      /*!< Reserved,                                    Address offset: 0x24 ~ 0x40 */
  __IO uint32_t UNLOCK2;           /*!< FLASH unlock register 2,                     Address offset: 0x44        */
  uint32_t      RESERVED2;         /*!< Reserved,                                    Address offset: 0x48        */
  __IO uint32_t STS2;              /*!< FLASH status register 2,                     Address offset: 0x4C        */
  __IO uint32_t CTRL2;             /*!< FLASH control register 2,                    Address offset: 0x50        */
  __IO uint32_t ADDR2;             /*!< FLASH address register 2,                    Address offset: 0x54        */
  uint32_t      RESERVED3[11];     /*!< Reserved,                                    Address offset: 0x58 ~ 0x80 */
  __IO uint32_t UNLOCK3;           /*!< FLASH unlock register 3,                     Address offset: 0x84        */
  __IO uint32_t SELECT;            /*!< FLASH select register,                       Address offset: 0x88        */
  __IO uint32_t STS3;              /*!< FLASH status register 3,                     Address offset: 0x8C        */
  __IO uint32_t CTRL3;             /*!< FLASH control register 3,                    Address offset: 0x90        */
  __IO uint32_t ADDR3;             /*!< FLASH address register 3,                    Address offset: 0x94        */
  __IO uint32_t DA;                /*!< FLASH decrption address register,            Address offset: 0x98        */
  uint32_t      RESERVED4[12];     /*!< Reserved,                                    Address offset: 0x9C ~ 0xC8 */
  __IO uint32_t SLIB_STS0;         /*!< FLASH security library status register 0,    Address offset: 0xCC        */
  __IO uint32_t SLIB_STS1;         /*!< FLASH security library status register 1,    Address offset: 0xD0        */
  __IO uint32_t SLIB_PWD_CLR;      /*!< FLASH security library password clear reg,   Address offset: 0xD4        */
  __IO uint32_t SLIB_MISC_STS;     /*!< FLASH Security library additional stat reg,  Address offset: 0xD8        */
  __IO uint32_t SLIB_SET_PWD;      /*!< FLASH Security library password setting reg, Address offset: 0xDC        */
  __IO uint32_t SLIB_SET_RANGE;    /*!< FLASH Security library address setting reg,  Address offset: 0xE0        */
  uint32_t      RESERVED5[3];      /*!< Reserved,                                    Address offset: 0xE4 ~ 0xEC */
  __IO uint32_t SLIB_UNLOCK;       /*!< FLASH Security library unlock register,      Address offset: 0xF0        */
  __IO uint32_t CRC_CTRL;          /*!< FLASH CRC check control register,            Address offset: 0xF4        */
  __IO uint32_t CRC_CHKR;          /*!< FLASH CRC check result register,             Address offset: 0xF8        */
} FLASH_TypeDef;

/**
  * @brief User System Data Registers
  */

