HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
#define DMA1_BASE             (AHBPERIPH_BASE + 0x00000000U)  /*!< DMA1 base address                              */
#define DMA1_Channel1_BASE    (AHBPERIPH_BASE + 0x00000008U)  /*!< DMA1 Channel 1 base address                    */
#define DMA1_Channel2_BASE    (AHBPERIPH_BASE + 0x0000001CU)  /*!< DMA1 Channel 2 base address                    */
#define DMA1_Channel3_BASE    (AHBPERIPH_BASE + 0x00000030U)  /*!< DMA1 Channel 3 base address                    */
#define DMA1_Channel4_BASE    (AHBPERIPH_BASE + 0x00000044U)  /*!< DMA1 Channel 4 base address                    */
#define DMA1_Channel5_BASE    (AHBPERIPH_BASE + 0x00000058U)  /*!< DMA1 Channel 5 base address                    */
#define DMA1_Channel6_BASE    (AHBPERIPH_BASE + 0x0000006CU)  /*!< DMA1 Channel 6 base address                    */
#define DMA1_Channel7_BASE    (AHBPERIPH_BASE + 0x00000080U)  /*!< DMA1 Channel 7 base address                    */
#define DMA2_BASE             (AHBPERIPH_BASE + 0x00000400U)  /*!< DMA2 base address                              */
#define DMA2_Channel1_BASE    (AHBPERIPH_BASE + 0x00000408U)  /*!< DMA2 Channel 1 base address                    */
#define DMA2_Channel2_BASE    (AHBPERIPH_BASE + 0x0000041CU)  /*!< DMA2 Channel 2 base address                    */
#define DMA2_Channel3_BASE    (AHBPERIPH_BASE + 0x00000430U)  /*!< DMA2 Channel 3 base address                    */
#define DMA2_Channel4_BASE    (AHBPERIPH_BASE + 0x00000444U)  /*!< DMA2 Channel 4 base address                    */
#define DMA2_Channel5_BASE    (AHBPERIPH_BASE + 0x00000458U)  /*!< DMA2 Channel 5 base address                    */
#define DMA2_Channel6_BASE    (AHBPERIPH_BASE + 0x0000046CU)  /*!< DMA2 Channel 6 base address                    */
#define DMA2_Channel7_BASE    (AHBPERIPH_BASE + 0x00000480U)  /*!< DMA2 Channel 7 base address                    */
#define CRM_BASE              (AHBPERIPH_BASE + 0x00001000U)  /*!< CRM base address                               */
#define CRC_BASE              (AHBPERIPH_BASE + 0x00003000U)  /*!< CRC base address                               */

#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x00002000U)  /*!< FLASH registers base address                   */
#define FLASHSIZE_BASE        0x1FFFF7E0U                     /*!< FLASH Size register base address               */
#define UID1_BASE             0x1FFFF7E8U                     /*!< Unique device ID register 1 base address       */
#define UID2_BASE             0x1FFFF7ECU                     /*!< Unique device ID register 2 base address       */
#define UID3_BASE             0x1FFFF7F0U                     /*!< Unique device ID register 3 base address       */
#define USD_BASE              0x1FFFF800U                     /*!< FLASH User System Data base address            */

#define XMC_BANK1             (XMC_BASE)                      /*!< XMC Bank 1 base address                        */
#define XMC_BANK1_1           (XMC_BANK1)                     /*!< XMC Bank 1_1 base address                      */
#define XMC_BANK1_4           (XMC_BANK1 + 0x0C000000U)       /*!< XMC Bank 1_4 base address                      */

#define XMC_BANK2             (XMC_BASE  + 0x10000000U)       /*!< XMC Bank 2 base address                        */

#define XMC_BANK1_R_BASE      (XMC_R_BASE + 0x00000000U)      /*!< XMC Bank 1 registers base address              */
#define XMC_BANK1E_R_BASE     (XMC_R_BASE + 0x00000104U)      /*!< XMC Bank 1E registers base address             */
#define XMC_BANK1E_H_BASE     (XMC_R_BASE + 0x00000220U)      /*!< XMC Bank 1H registers base address             */
#define XMC_BANK2_R_BASE      (XMC_R_BASE + 0x00000060U)      /*!< XMC Bank 2 registers base address              */

#define DEBUG_BASE            0xE0042000U                     /*!< Debug MCU registers base address               */

/* USB device FS */
#define USB_BASE              (APB1PERIPH_BASE + 0x00005C00U) /*!< USB_IP Peripheral Registers base address       */
#define USB_BUFS0             (APB1PERIPH_BASE + 0x00006000U) /*!< USB_IP Core FIFO Area base address             */
#define USB_BUFS1             (APB1PERIPH_BASE + 0x00007800U) /*!< USB_IP Core FIFO Area base address             */

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */

#define ACC                 ((ACC_TypeDef *)ACC_BASE)
#define ADC1                ((ADC_TypeDef *)ADC1_BASE)
#define ADC2                ((ADC_TypeDef *)ADC2_BASE)
#define ADC3                ((ADC_TypeDef *)ADC3_BASE)
#define ADC12_COMMON        ((ADC_Common_TypeDef *)ADC1_BASE)
#define BPR                 ((BPR_TypeDef *)BPR_BASE)
#define CAN1                ((CAN_TypeDef *)CAN1_BASE)
#define CAN2                ((CAN_TypeDef *)CAN2_BASE)
#define CRC                 ((CRC_TypeDef *)CRC_BASE)
#define CRM                 ((CRM_TypeDef *)CRM_BASE)
#define DAC                 ((DAC_TypeDef *)DAC_BASE)                   /* Kept for legacy purpose */
#define DAC1                ((DAC_TypeDef *)DAC_BASE)
#define DEBUG               ((DEBUG_TypeDef *)DEBUG_BASE)
#define DMA1                ((DMA_TypeDef *)DMA1_BASE)
#define DMA1_Channel1       ((DMA_Channel_TypeDef *)DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMA_Channel_TypeDef *)DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMA_Channel_TypeDef *)DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMA_Channel_TypeDef *)DMA1_Channel4_BASE)
#define DMA1_Channel5       ((DMA_Channel_TypeDef *)DMA1_Channel5_BASE)
#define DMA1_Channel6       ((DMA_Channel_TypeDef *)DMA1_Channel6_BASE)
#define DMA1_Channel7       ((DMA_Channel_TypeDef *)DMA1_Channel7_BASE)
#define DMA2                ((DMA_TypeDef *)DMA2_BASE)
#define DMA2_Channel1       ((DMA_Channel_TypeDef *)DMA2_Channel1_BASE)
#define DMA2_Channel2       ((DMA_Channel_TypeDef *)DMA2_Channel2_BASE)
#define DMA2_Channel3       ((DMA_Channel_TypeDef *)DMA2_Channel3_BASE)
#define DMA2_Channel4       ((DMA_Channel_TypeDef *)DMA2_Channel4_BASE)
#define DMA2_Channel5       ((DMA_Channel_TypeDef *)DMA2_Channel5_BASE)
#define DMA2_Channel6       ((DMA_Channel_TypeDef *)DMA2_Channel6_BASE)
#define DMA2_Channel7       ((DMA_Channel_TypeDef *)DMA2_Channel7_BASE)
#define EXINT               ((EXINT_TypeDef *)EXINT_BASE)
#define FLASH               ((FLASH_TypeDef *)FLASH_R_BASE)
#define USD                 ((USD_TypeDef *)USD_BASE)
#define GPIOA               ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD               ((GPIO_TypeDef *)GPIOD_BASE)
#define GPIOE               ((GPIO_TypeDef *)GPIOE_BASE)
#define IOMUX               ((IOMUX_TypeDef *)IOMUX_BASE)
#define I2C1                ((I2C_TypeDef *)I2C1_BASE)
#define I2C2                ((I2C_TypeDef *)I2C2_BASE)
#define I2C3                ((I2C_TypeDef *)I2C3_BASE)
#define PWC                 ((PWC_TypeDef *)PWC_BASE)
#define RTC                 ((RTC_TypeDef *)RTC_BASE)
#define SDIO1               ((SDIO_TypeDef *)SDIO1_BASE)
#define SDIO2               ((SDIO_TypeDef *)SDIO2_BASE)
#define SPI1                ((SPI_TypeDef *)SPI1_BASE)
#define SPI2                ((SPI_TypeDef *)SPI2_BASE)
#define SPI3                ((SPI_TypeDef *)SPI3_BASE)
#define SPI4                ((SPI_TypeDef *)SPI4_BASE)
#define I2S2EXT             ((SPI_TypeDef *)I2S2EXT_BASE)
#define I2S3EXT             ((SPI_TypeDef *)I2S3EXT_BASE)
#define TMR1                ((TMR_TypeDef *)TMR1_BASE)
#define TMR2                ((TMR_TypeDef *)TMR2_BASE)
#define TMR3                ((TMR_TypeDef *)TMR3_BASE)
#define TMR4                ((TMR_TypeDef *)TMR4_BASE)
#define TMR5                ((TMR_TypeDef *)TMR5_BASE)
#define TMR6                ((TMR_TypeDef *)TMR6_BASE)
#define TMR7                ((TMR_TypeDef *)TMR7_BASE)
#define TMR8                ((TMR_TypeDef *)TMR8_BASE)
#define TMR9                ((TMR_TypeDef *)TMR9_BASE)
#define TMR10               ((TMR_TypeDef *)TMR10_BASE)
#define TMR11               ((TMR_TypeDef *)TMR11_BASE)
#define TMR12               ((TMR_TypeDef *)TMR12_BASE)
#define TMR13               ((TMR_TypeDef *)TMR13_BASE)
#define TMR14               ((TMR_TypeDef *)TMR14_BASE)
#define USART1              ((USART_TypeDef *)USART1_BASE)
#define USART2              ((USART_TypeDef *)USART2_BASE)
#define USART3              ((USART_TypeDef *)USART3_BASE)
#define UART4               ((USART_TypeDef *)UART4_BASE)
#define UART5               ((USART_TypeDef *)UART5_BASE)
#define USART6              ((USART_TypeDef *)USART6_BASE)
#define UART7               ((USART_TypeDef *)UART7_BASE)
#define UART8               ((USART_TypeDef *)UART8_BASE)
#define USB                 ((USB_TypeDef *)USB_BASE)
#define WDT                 ((WDT_TypeDef *)WDT_BASE)
#define WWDT                ((WWDT_TypeDef *)WWDT_BASE)
#define XMC_Bank1           ((XMC_Bank1_TypeDef *)XMC_BANK1_R_BASE)
#define XMC_Bank2           ((XMC_Bank2_TypeDef *)XMC_BANK2_R_BASE)

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                    Peripheral registers bits definition                    */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                             Power Control (PWC)                            */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for PWC_CTRL register  *******************/
#define PWC_CTRL_VRSEL_Pos                  (0U)
#define PWC_CTRL_VRSEL_Msk                  (0x1U << PWC_CTRL_VRSEL_Pos)            /*!< 0x00000001 */
#define PWC_CTRL_VRSEL                      PWC_CTRL_VRSEL_Msk                      /*!< LDO state select in deep sleep mode */
#define PWC_CTRL_LPSEL_Pos                  (1U)
#define PWC_CTRL_LPSEL_Msk                  (0x1U << PWC_CTRL_LPSEL_Pos)            /*!< 0x00000002 */
#define PWC_CTRL_LPSEL                      PWC_CTRL_LPSEL_Msk                      /*!< Low power mode select in deep sleep */
#define PWC_CTRL_CLSWEF_Pos                 (2U)
#define PWC_CTRL_CLSWEF_Msk                 (0x1U << PWC_CTRL_CLSWEF_Pos)           /*!< 0x00000004 */
#define PWC_CTRL_CLSWEF                     PWC_CTRL_CLSWEF_Msk                     /*!< Clear SWEF flag */
#define PWC_CTRL_CLSEF_Pos                  (3U)
#define PWC_CTRL_CLSEF_Msk                  (0x1U << PWC_CTRL_CLSEF_Pos)            /*!< 0x00000008 */
#define PWC_CTRL_CLSEF                      PWC_CTRL_CLSEF_Msk                      /*!< Clear SEF flag */
#define PWC_CTRL_PVMEN_Pos                  (4U)
#define PWC_CTRL_PVMEN_Msk                  (0x1U << PWC_CTRL_PVMEN_Pos)            /*!< 0x00000010 */
#define PWC_CTRL_PVMEN                      PWC_CTRL_PVMEN_Msk                      /*!< Power voltage monitoring enable */

/*!< PVM level configuration */
#define PWC_CTRL_PVMSEL_Pos                 (5U)
#define PWC_CTRL_PVMSEL_Msk                 (0x7U << PWC_CTRL_PVMSEL_Pos)           /*!< 0x000000E0 */
#define PWC_CTRL_PVMSEL                     PWC_CTRL_PVMSEL_Msk                     /*!< PVMSEL[2:0] bits (Power voltage monitoring boundary select) */
#define PWC_CTRL_PVMSEL_0                   (0x1U << PWC_CTRL_PVMSEL_Pos)           /*!< 0x00000020 */
#define PWC_CTRL_PVMSEL_1                   (0x2U << PWC_CTRL_PVMSEL_Pos)           /*!< 0x00000040 */
#define PWC_CTRL_PVMSEL_2                   (0x4U << PWC_CTRL_PVMSEL_Pos)           /*!< 0x00000080 */

#define PWC_CTRL_PVMSEL_LEV1                0x00000020U                             /*!< PVM level 2.3V */
#define PWC_CTRL_PVMSEL_LEV2                0x00000040U                             /*!< PVM level 2.4V */
#define PWC_CTRL_PVMSEL_LEV3                0x00000060U                             /*!< PVM level 2.5V */
#define PWC_CTRL_PVMSEL_LEV4                0x00000080U                             /*!< PVM level 2.6V */
#define PWC_CTRL_PVMSEL_LEV5                0x000000A0U                             /*!< PVM level 2.7V */
#define PWC_CTRL_PVMSEL_LEV6                0x000000C0U                             /*!< PVM level 2.8V */
#define PWC_CTRL_PVMSEL_LEV7                0x000000E0U                             /*!< PVM level 2.9V */

