HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
/******************  Bit definition for CRM_APB2EN register  ******************/
#define CRM_APB2EN_IOMUXEN_Pos              (0U)
#define CRM_APB2EN_IOMUXEN_Msk              (0x1U << CRM_APB2EN_IOMUXEN_Pos)        /*!< 0x00000001 */
#define CRM_APB2EN_IOMUXEN                  CRM_APB2EN_IOMUXEN_Msk                  /*!< IOMUX clock enable */
#define CRM_APB2EN_GPIOAEN_Pos              (2U)
#define CRM_APB2EN_GPIOAEN_Msk              (0x1U << CRM_APB2EN_GPIOAEN_Pos)        /*!< 0x00000004 */
#define CRM_APB2EN_GPIOAEN                  CRM_APB2EN_GPIOAEN_Msk                  /*!< GPIOA clock enable */
#define CRM_APB2EN_GPIOBEN_Pos              (3U)
#define CRM_APB2EN_GPIOBEN_Msk              (0x1U << CRM_APB2EN_GPIOBEN_Pos)        /*!< 0x00000008 */
#define CRM_APB2EN_GPIOBEN                  CRM_APB2EN_GPIOBEN_Msk                  /*!< GPIOB clock enable */
#define CRM_APB2EN_GPIOCEN_Pos              (4U)
#define CRM_APB2EN_GPIOCEN_Msk              (0x1U << CRM_APB2EN_GPIOCEN_Pos)        /*!< 0x00000010 */
#define CRM_APB2EN_GPIOCEN                  CRM_APB2EN_GPIOCEN_Msk                  /*!< GPIOC clock enable */
#define CRM_APB2EN_GPIODEN_Pos              (5U)
#define CRM_APB2EN_GPIODEN_Msk              (0x1U << CRM_APB2EN_GPIODEN_Pos)        /*!< 0x00000020 */
#define CRM_APB2EN_GPIODEN                  CRM_APB2EN_GPIODEN_Msk                  /*!< GPIOD clock enable */
#define CRM_APB2EN_GPIOEEN_Pos              (6U)
#define CRM_APB2EN_GPIOEEN_Msk              (0x1U << CRM_APB2EN_GPIOEEN_Pos)        /*!< 0x00000040 */
#define CRM_APB2EN_GPIOEEN                  CRM_APB2EN_GPIOEEN_Msk                  /*!< GPIOE clock enable */
#define CRM_APB2EN_ADC1EN_Pos               (9U)
#define CRM_APB2EN_ADC1EN_Msk               (0x1U << CRM_APB2EN_ADC1EN_Pos)         /*!< 0x00000200 */
#define CRM_APB2EN_ADC1EN                   CRM_APB2EN_ADC1EN_Msk                   /*!< ADC1 clock enable */
#define CRM_APB2EN_ADC2EN_Pos               (10U)
#define CRM_APB2EN_ADC2EN_Msk               (0x1U << CRM_APB2EN_ADC2EN_Pos)         /*!< 0x00000400 */
#define CRM_APB2EN_ADC2EN                   CRM_APB2EN_ADC2EN_Msk                   /*!< ADC2 clock enable */
#define CRM_APB2EN_TMR1EN_Pos               (11U)
#define CRM_APB2EN_TMR1EN_Msk               (0x1U << CRM_APB2EN_TMR1EN_Pos)         /*!< 0x00000800 */
#define CRM_APB2EN_TMR1EN                   CRM_APB2EN_TMR1EN_Msk                   /*!< TMR1 clock enable */
#define CRM_APB2EN_SPI1EN_Pos               (12U)
#define CRM_APB2EN_SPI1EN_Msk               (0x1U << CRM_APB2EN_SPI1EN_Pos)         /*!< 0x00001000 */
#define CRM_APB2EN_SPI1EN                   CRM_APB2EN_SPI1EN_Msk                   /*!< SPI1 clock enable */
#define CRM_APB2EN_TMR8EN_Pos               (13U)
#define CRM_APB2EN_TMR8EN_Msk               (0x1U << CRM_APB2EN_TMR8EN_Pos)         /*!< 0x00002000 */
#define CRM_APB2EN_TMR8EN                   CRM_APB2EN_TMR8EN_Msk                   /*!< TMR8 clock enable */
#define CRM_APB2EN_USART1EN_Pos             (14U)
#define CRM_APB2EN_USART1EN_Msk             (0x1U << CRM_APB2EN_USART1EN_Pos)       /*!< 0x00004000 */
#define CRM_APB2EN_USART1EN                 CRM_APB2EN_USART1EN_Msk                 /*!< USART1 clock enable */
#define CRM_APB2EN_ADC3EN_Pos               (15U)
#define CRM_APB2EN_ADC3EN_Msk               (0x1U << CRM_APB2EN_ADC3EN_Pos)         /*!< 0x00008000 */
#define CRM_APB2EN_ADC3EN                   CRM_APB2EN_ADC3EN_Msk                   /*!< ADC3 clock enable */
#define CRM_APB2EN_TMR9EN_Pos               (19U)
#define CRM_APB2EN_TMR9EN_Msk               (0x1U << CRM_APB2EN_TMR9EN_Pos)         /*!< 0x00080000 */
#define CRM_APB2EN_TMR9EN                   CRM_APB2EN_TMR9EN_Msk                   /*!< TMR9 clock enable */
#define CRM_APB2EN_TMR10EN_Pos              (20U)
#define CRM_APB2EN_TMR10EN_Msk              (0x1U << CRM_APB2EN_TMR10EN_Pos)        /*!< 0x00100000 */
#define CRM_APB2EN_TMR10EN                  CRM_APB2EN_TMR10EN_Msk                  /*!< TMR10 clock enable */
#define CRM_APB2EN_TMR11EN_Pos              (21U)
#define CRM_APB2EN_TMR11EN_Msk              (0x1U << CRM_APB2EN_TMR11EN_Pos)        /*!< 0x00200000 */
#define CRM_APB2EN_TMR11EN                  CRM_APB2EN_TMR11EN_Msk                  /*!< TMR11 clock enable */
#define CRM_APB2EN_ACCEN_Pos                (22U)
#define CRM_APB2EN_ACCEN_Msk                (0x1U << CRM_APB2EN_ACCEN_Pos)          /*!< 0x00400000 */
#define CRM_APB2EN_ACCEN                    CRM_APB2EN_ACCEN_Msk                    /*!< ACC clock enable */
#define CRM_APB2EN_I2C3EN_Pos               (23U)
#define CRM_APB2EN_I2C3EN_Msk               (0x1U << CRM_APB2EN_I2C3EN_Pos)         /*!< 0x00800000 */
#define CRM_APB2EN_I2C3EN                   CRM_APB2EN_I2C3EN_Msk                   /*!< I2C3 clock enable */
#define CRM_APB2EN_USART6EN_Pos             (24U)
#define CRM_APB2EN_USART6EN_Msk             (0x1U << CRM_APB2EN_USART6EN_Pos)       /*!< 0x01000000 */
#define CRM_APB2EN_USART6EN                 CRM_APB2EN_USART6EN_Msk                 /*!< USART6 clock enable */
#define CRM_APB2EN_UART7EN_Pos              (25U)
#define CRM_APB2EN_UART7EN_Msk              (0x1U << CRM_APB2EN_UART7EN_Pos)        /*!< 0x02000000 */
#define CRM_APB2EN_UART7EN                  CRM_APB2EN_UART7EN_Msk                  /*!< UART7 clock enable */
#define CRM_APB2EN_UART8EN_Pos              (26U)
#define CRM_APB2EN_UART8EN_Msk              (0x1U << CRM_APB2EN_UART8EN_Pos)        /*!< 0x04000000 */
#define CRM_APB2EN_UART8EN                  CRM_APB2EN_UART8EN_Msk                  /*!< UART8 clock enable */

/******************  Bit definition for CRM_APB1EN register  ******************/
#define CRM_APB1EN_TMR2EN_Pos               (0U)
#define CRM_APB1EN_TMR2EN_Msk               (0x1U << CRM_APB1EN_TMR2EN_Pos)         /*!< 0x00000001 */
#define CRM_APB1EN_TMR2EN                   CRM_APB1EN_TMR2EN_Msk                   /*!< TMR2 clock enable */
#define CRM_APB1EN_TMR3EN_Pos               (1U)
#define CRM_APB1EN_TMR3EN_Msk               (0x1U << CRM_APB1EN_TMR3EN_Pos)         /*!< 0x00000002 */
#define CRM_APB1EN_TMR3EN                   CRM_APB1EN_TMR3EN_Msk                   /*!< TMR3 clock enable */
#define CRM_APB1EN_TMR4EN_Pos               (2U)
#define CRM_APB1EN_TMR4EN_Msk               (0x1U << CRM_APB1EN_TMR4EN_Pos)         /*!< 0x00000004 */
#define CRM_APB1EN_TMR4EN                   CRM_APB1EN_TMR4EN_Msk                   /*!< TMR4 clock enable */
#define CRM_APB1EN_TMR5EN_Pos               (3U)
#define CRM_APB1EN_TMR5EN_Msk               (0x1U << CRM_APB1EN_TMR5EN_Pos)         /*!< 0x00000008 */
#define CRM_APB1EN_TMR5EN                   CRM_APB1EN_TMR5EN_Msk                   /*!< TMR5 clock enable */
#define CRM_APB1EN_TMR6EN_Pos               (4U)
#define CRM_APB1EN_TMR6EN_Msk               (0x1U << CRM_APB1EN_TMR6EN_Pos)         /*!< 0x00000010 */
#define CRM_APB1EN_TMR6EN                   CRM_APB1EN_TMR6EN_Msk                   /*!< TMR6 clock enable */
#define CRM_APB1EN_TMR7EN_Pos               (5U)
#define CRM_APB1EN_TMR7EN_Msk               (0x1U << CRM_APB1EN_TMR7EN_Pos)         /*!< 0x00000020 */
#define CRM_APB1EN_TMR7EN                   CRM_APB1EN_TMR7EN_Msk                   /*!< TMR7 clock enable */
#define CRM_APB1EN_TMR12EN_Pos              (6U)
#define CRM_APB1EN_TMR12EN_Msk              (0x1U << CRM_APB1EN_TMR12EN_Pos)        /*!< 0x00000040 */
#define CRM_APB1EN_TMR12EN                  CRM_APB1EN_TMR12EN_Msk                  /*!< TMR12 clock enable  */
#define CRM_APB1EN_TMR13EN_Pos              (7U)
#define CRM_APB1EN_TMR13EN_Msk              (0x1U << CRM_APB1EN_TMR13EN_Pos)        /*!< 0x00000080 */
#define CRM_APB1EN_TMR13EN                  CRM_APB1EN_TMR13EN_Msk                  /*!< TMR13 clock enable  */
#define CRM_APB1EN_TMR14EN_Pos              (8U)
#define CRM_APB1EN_TMR14EN_Msk              (0x1U << CRM_APB1EN_TMR14EN_Pos)        /*!< 0x00000100 */
#define CRM_APB1EN_TMR14EN                  CRM_APB1EN_TMR14EN_Msk                  /*!< TMR14 clock enable */
#define CRM_APB1EN_WWDTEN_Pos               (11U)
#define CRM_APB1EN_WWDTEN_Msk               (0x1U << CRM_APB1EN_WWDTEN_Pos)         /*!< 0x00000800 */
#define CRM_APB1EN_WWDTEN                   CRM_APB1EN_WWDTEN_Msk                   /*!< WWDT clock enable */
#define CRM_APB1EN_SPI2EN_Pos               (14U)
#define CRM_APB1EN_SPI2EN_Msk               (0x1U << CRM_APB1EN_SPI2EN_Pos)         /*!< 0x00004000 */
#define CRM_APB1EN_SPI2EN                   CRM_APB1EN_SPI2EN_Msk                   /*!< SPI2 clock enable */
#define CRM_APB1EN_SPI3EN_Pos               (15U)
#define CRM_APB1EN_SPI3EN_Msk               (0x1U << CRM_APB1EN_SPI3EN_Pos)         /*!< 0x00008000 */
#define CRM_APB1EN_SPI3EN                   CRM_APB1EN_SPI3EN_Msk                   /*!< SPI3 clock enable */
#define CRM_APB1EN_SPI4EN_Pos               (16U)
#define CRM_APB1EN_SPI4EN_Msk               (0x1U << CRM_APB1EN_SPI4EN_Pos)         /*!< 0x00010000 */
#define CRM_APB1EN_SPI4EN                   CRM_APB1EN_SPI4EN_Msk                   /*!< SPI4 clock enable */
#define CRM_APB1EN_USART2EN_Pos             (17U)
#define CRM_APB1EN_USART2EN_Msk             (0x1U << CRM_APB1EN_USART2EN_Pos)       /*!< 0x00020000 */
#define CRM_APB1EN_USART2EN                 CRM_APB1EN_USART2EN_Msk                 /*!< USART2 clock enable */
#define CRM_APB1EN_USART3EN_Pos             (18U)
#define CRM_APB1EN_USART3EN_Msk             (0x1U << CRM_APB1EN_USART3EN_Pos)       /*!< 0x00040000 */
#define CRM_APB1EN_USART3EN                 CRM_APB1EN_USART3EN_Msk                 /*!< USART3 clock enable */
#define CRM_APB1EN_UART4EN_Pos              (19U)
#define CRM_APB1EN_UART4EN_Msk              (0x1U << CRM_APB1EN_UART4EN_Pos)        /*!< 0x00080000 */
#define CRM_APB1EN_UART4EN                  CRM_APB1EN_UART4EN_Msk                  /*!< UART4 clock enable */
#define CRM_APB1EN_UART5EN_Pos              (20U)
#define CRM_APB1EN_UART5EN_Msk              (0x1U << CRM_APB1EN_UART5EN_Pos)        /*!< 0x00100000 */
#define CRM_APB1EN_UART5EN                  CRM_APB1EN_UART5EN_Msk                  /*!< UART5 clock enable */
#define CRM_APB1EN_I2C1EN_Pos               (21U)
#define CRM_APB1EN_I2C1EN_Msk               (0x1U << CRM_APB1EN_I2C1EN_Pos)         /*!< 0x00200000 */
#define CRM_APB1EN_I2C1EN                   CRM_APB1EN_I2C1EN_Msk                   /*!< I2C1 clock enable */
#define CRM_APB1EN_I2C2EN_Pos               (22U)
#define CRM_APB1EN_I2C2EN_Msk               (0x1U << CRM_APB1EN_I2C2EN_Pos)         /*!< 0x00400000 */
#define CRM_APB1EN_I2C2EN                   CRM_APB1EN_I2C2EN_Msk                   /*!< I2C2 clock enable */
#define CRM_APB1EN_USBEN_Pos                (23U)
#define CRM_APB1EN_USBEN_Msk                (0x1U << CRM_APB1EN_USBEN_Pos)          /*!< 0x00800000 */
#define CRM_APB1EN_USBEN                    CRM_APB1EN_USBEN_Msk                    /*!< USB clock enable */
#define CRM_APB1EN_CAN1EN_Pos               (25U)
#define CRM_APB1EN_CAN1EN_Msk               (0x1U << CRM_APB1EN_CAN1EN_Pos)         /*!< 0x02000000 */
#define CRM_APB1EN_CAN1EN                   CRM_APB1EN_CAN1EN_Msk                   /*!< CAN1 clock enable */
#define CRM_APB1EN_CAN2EN_Pos               (26U)
#define CRM_APB1EN_CAN2EN_Msk               (0x1U << CRM_APB1EN_CAN2EN_Pos)         /*!< 0x04000000 */
#define CRM_APB1EN_CAN2EN                   CRM_APB1EN_CAN2EN_Msk                   /*!< CAN2 clock enable */
#define CRM_APB1EN_BPREN_Pos                (27U)
#define CRM_APB1EN_BPREN_Msk                (0x1U << CRM_APB1EN_BPREN_Pos)          /*!< 0x08000000 */
#define CRM_APB1EN_BPREN                    CRM_APB1EN_BPREN_Msk                    /*!< BPR clock enable */
#define CRM_APB1EN_PWCEN_Pos                (28U)
#define CRM_APB1EN_PWCEN_Msk                (0x1U << CRM_APB1EN_PWCEN_Pos)          /*!< 0x10000000 */
#define CRM_APB1EN_PWCEN                    CRM_APB1EN_PWCEN_Msk                    /*!< Power control clock enable */
#define CRM_APB1EN_DACEN_Pos                (29U)
#define CRM_APB1EN_DACEN_Msk                (0x1U << CRM_APB1EN_DACEN_Pos)          /*!< 0x20000000 */
#define CRM_APB1EN_DACEN                    CRM_APB1EN_DACEN_Msk                    /*!< DAC clock enable */

/*******************  Bit definition for CRM_BPDC register  *******************/
#define CRM_BPDC_LEXTEN_Pos                 (0U)
#define CRM_BPDC_LEXTEN_Msk                 (0x1U << CRM_BPDC_LEXTEN_Pos)           /*!< 0x00000001 */
#define CRM_BPDC_LEXTEN                     CRM_BPDC_LEXTEN_Msk                     /*!< External low-speed oscillator enable */
#define CRM_BPDC_LEXTSTBL_Pos               (1U)
#define CRM_BPDC_LEXTSTBL_Msk               (0x1U << CRM_BPDC_LEXTSTBL_Pos)         /*!< 0x00000002 */
#define CRM_BPDC_LEXTSTBL                   CRM_BPDC_LEXTSTBL_Msk                   /*!< Low speed external oscillator stable */
#define CRM_BPDC_LEXTBYPS_Pos               (2U)
#define CRM_BPDC_LEXTBYPS_Msk               (0x1U << CRM_BPDC_LEXTBYPS_Pos)         /*!< 0x00000004 */
#define CRM_BPDC_LEXTBYPS                   CRM_BPDC_LEXTBYPS_Msk                   /*!< Low speed external crystal bypass */

/*!< RTCSEL congiguration */
#define CRM_BPDC_RTCSEL_Pos                 (8U)
#define CRM_BPDC_RTCSEL_Msk                 (0x3U << CRM_BPDC_RTCSEL_Pos)           /*!< 0x00000300 */
#define CRM_BPDC_RTCSEL                     CRM_BPDC_RTCSEL_Msk                     /*!< RTCSEL[1:0] bits (RTC clock selection) */
#define CRM_BPDC_RTCSEL_0                   (0x1U << CRM_BPDC_RTCSEL_Pos)           /*!< 0x00000100 */
#define CRM_BPDC_RTCSEL_1                   (0x2U << CRM_BPDC_RTCSEL_Pos)           /*!< 0x00000200 */

#define CRM_BPDC_RTCSEL_NOCLOCK             0x00000000U                             /*!< No clock */
#define CRM_BPDC_RTCSEL_LEXT                0x00000100U                             /*!< LEXT */
#define CRM_BPDC_RTCSEL_LICK                0x00000200U                             /*!< LICK */
#define CRM_BPDC_RTCSEL_HEXT                0x00000300U                             /*!< HEXT/128 */

#define CRM_BPDC_RTCEN_Pos                  (15U)
#define CRM_BPDC_RTCEN_Msk                  (0x1U << CRM_BPDC_RTCEN_Pos)            /*!< 0x00008000 */
#define CRM_BPDC_RTCEN                      CRM_BPDC_RTCEN_Msk                      /*!< RTC clock enable */
#define CRM_BPDC_BPDRST_Pos                 (16U)
#define CRM_BPDC_BPDRST_Msk                 (0x1U << CRM_BPDC_BPDRST_Pos)           /*!< 0x00010000 */
#define CRM_BPDC_BPDRST                     CRM_BPDC_BPDRST_Msk                     /*!< Battery powered domain software reset */

/*****************  Bit definition for CRM_CTRLSTS register  ******************/
#define CRM_CTRLSTS_LICKEN_Pos              (0U)
#define CRM_CTRLSTS_LICKEN_Msk              (0x1U << CRM_CTRLSTS_LICKEN_Pos)        /*!< 0x00000001 */
#define CRM_CTRLSTS_LICKEN                  CRM_CTRLSTS_LICKEN_Msk                  /*!< LICK enable */
#define CRM_CTRLSTS_LICKSTBL_Pos            (1U)
#define CRM_CTRLSTS_LICKSTBL_Msk            (0x1U << CRM_CTRLSTS_LICKSTBL_Pos)      /*!< 0x00000002 */
#define CRM_CTRLSTS_LICKSTBL                CRM_CTRLSTS_LICKSTBL_Msk                /*!< LICK stable */
#define CRM_CTRLSTS_RSTFC_Pos               (24U)
#define CRM_CTRLSTS_RSTFC_Msk               (0x1U << CRM_CTRLSTS_RSTFC_Pos)         /*!< 0x01000000 */
#define CRM_CTRLSTS_RSTFC                   CRM_CTRLSTS_RSTFC_Msk                   /*!< Reset flag clear */
#define CRM_CTRLSTS_NRSTF_Pos               (26U)
#define CRM_CTRLSTS_NRSTF_Msk               (0x1U << CRM_CTRLSTS_NRSTF_Pos)         /*!< 0x04000000 */
#define CRM_CTRLSTS_NRSTF                   CRM_CTRLSTS_NRSTF_Msk                   /*!< NRST pin reset flag */
#define CRM_CTRLSTS_PORRSTF_Pos             (27U)
#define CRM_CTRLSTS_PORRSTF_Msk             (0x1U << CRM_CTRLSTS_PORRSTF_Pos)       /*!< 0x08000000 */
#define CRM_CTRLSTS_PORRSTF                 CRM_CTRLSTS_PORRSTF_Msk                 /*!< POR/LVR reset flag */
#define CRM_CTRLSTS_SWRSTF_Pos              (28U)
#define CRM_CTRLSTS_SWRSTF_Msk              (0x1U << CRM_CTRLSTS_SWRSTF_Pos)        /*!< 0x10000000 */
#define CRM_CTRLSTS_SWRSTF                  CRM_CTRLSTS_SWRSTF_Msk                  /*!< Software reset flag */
#define CRM_CTRLSTS_WDTRSTF_Pos             (29U)
#define CRM_CTRLSTS_WDTRSTF_Msk             (0x1U << CRM_CTRLSTS_WDTRSTF_Pos)       /*!< 0x20000000 */
#define CRM_CTRLSTS_WDTRSTF                 CRM_CTRLSTS_WDTRSTF_Msk                 /*!< Watchdog timer reset flag */
#define CRM_CTRLSTS_WWDTRSTF_Pos            (30U)
#define CRM_CTRLSTS_WWDTRSTF_Msk            (0x1U << CRM_CTRLSTS_WWDTRSTF_Pos)      /*!< 0x40000000 */
#define CRM_CTRLSTS_WWDTRSTF                CRM_CTRLSTS_WWDTRSTF_Msk                /*!< Window watchdog timer reset flag */
#define CRM_CTRLSTS_LPRSTF_Pos              (31U)
#define CRM_CTRLSTS_LPRSTF_Msk              (0x1U << CRM_CTRLSTS_LPRSTF_Pos)        /*!< 0x80000000 */
#define CRM_CTRLSTS_LPRSTF                  CRM_CTRLSTS_LPRSTF_Msk                  /*!< Low-power reset flag */

/******************  Bit definition for CRM_MISC1 register  *******************/
#define CRM_MISC1_HICKCAL_KEY_Pos           (0U)
#define CRM_MISC1_HICKCAL_KEY_Msk           (0xFFU << CRM_MISC1_HICKCAL_KEY_Pos)    /*!< 0x000000FF */
#define CRM_MISC1_HICKCAL_KEY               CRM_MISC1_HICKCAL_KEY_Msk               /*!< HICK calibration key */
#define CRM_MISC1_USBBUFS_Pos               (24U)
#define CRM_MISC1_USBBUFS_Msk               (0x1U << CRM_MISC1_USBBUFS_Pos)         /*!< 0x01000000 */
#define CRM_MISC1_USBBUFS                   CRM_MISC1_USBBUFS_Msk                   /*!< USB buffer size selection */
#define CRM_MISC1_HICKDIV_Pos               (25U)
#define CRM_MISC1_HICKDIV_Msk               (0x1U << CRM_MISC1_HICKDIV_Pos)         /*!< 0x02000000 */
#define CRM_MISC1_HICKDIV                   CRM_MISC1_HICKDIV_Msk                   /*!< HICK 6 divider selection */

/*!< CLKOUTDIV congiguration */
#define CRM_MISC1_CLKOUTDIV_Pos             (28U)
#define CRM_MISC1_CLKOUTDIV_Msk             (0xFU << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0xF0000000 */
#define CRM_MISC1_CLKOUTDIV                 CRM_MISC1_CLKOUTDIV_Msk                 /*!< CLKOUTDIV[3:0] bits (Clock output division */
#define CRM_MISC1_CLKOUTDIV_0               (0x1U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x10000000 */
#define CRM_MISC1_CLKOUTDIV_1               (0x2U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x20000000 */
#define CRM_MISC1_CLKOUTDIV_2               (0x4U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x40000000 */
#define CRM_MISC1_CLKOUTDIV_3               (0x8U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x80000000 */

#define CRM_MISC1_CLKOUTDIV_DIV1            0x00000000U                             /*!< No clock output */
#define CRM_MISC1_CLKOUTDIV_DIV2            0x80000000U                             /*!< Clock output divided by 2 */
#define CRM_MISC1_CLKOUTDIV_DIV4            0x90000000U                             /*!< Clock output divided by 4 */
#define CRM_MISC1_CLKOUTDIV_DIV8            0xA0000000U                             /*!< Clock output divided by 8 */
#define CRM_MISC1_CLKOUTDIV_DIV16           0xB0000000U                             /*!< Clock output divided by 16 */
#define CRM_MISC1_CLKOUTDIV_DIV64           0xC0000000U                             /*!< Clock output divided by 64 */
#define CRM_MISC1_CLKOUTDIV_DIV128          0xD0000000U                             /*!< Clock output divided by 128 */
#define CRM_MISC1_CLKOUTDIV_DIV256          0xE0000000U                             /*!< Clock output divided by 256 */
#define CRM_MISC1_CLKOUTDIV_DIV512          0xF0000000U                             /*!< Clock output divided by 512 */

/******************  Bit definition for CRM_MISC2 register  *******************/
#define CRM_MISC2_CLK_TO_TMR_Pos            (16U)
#define CRM_MISC2_CLK_TO_TMR_Msk            (0x1U << CRM_MISC2_CLK_TO_TMR_Pos)      /*!< 0x00010000 */
#define CRM_MISC2_CLK_TO_TMR                CRM_MISC2_CLK_TO_TMR_Msk                /*!< CLKOUT internally connected to timer 10 channel 1 */

/******************  Bit definition for CRM_MISC3 register  *******************/
#define CRM_MISC3_AUTO_STEP_EN_Pos          (4U)
#define CRM_MISC3_AUTO_STEP_EN_Msk          (0x3U << CRM_MISC3_AUTO_STEP_EN_Pos)    /*!< 0x00000030 */
#define CRM_MISC3_AUTO_STEP_EN              CRM_MISC3_AUTO_STEP_EN_Msk              /*!< AUTO_STEP_EN[1:0] HICK calibration key */
#define CRM_MISC3_AUTO_STEP_EN_0            (0x1U << CRM_MISC3_AUTO_STEP_EN_Pos)    /*!< 0x00000010 */
#define CRM_MISC3_AUTO_STEP_EN_1            (0x2U << CRM_MISC3_AUTO_STEP_EN_Pos)    /*!< 0x00000020 */

#define CRM_MISC3_HICK_TO_USB_Pos           (8U)
#define CRM_MISC3_HICK_TO_USB_Msk           (0x1U << CRM_MISC3_HICK_TO_USB_Pos)     /*!< 0x00000100 */
#define CRM_MISC3_HICK_TO_USB               CRM_MISC3_HICK_TO_USB_Msk               /*!< USB 48 MHz clock source select */
#define CRM_MISC3_HICK_TO_SCLK_Pos          (9U)
#define CRM_MISC3_HICK_TO_SCLK_Msk          (0x1U << CRM_MISC3_HICK_TO_SCLK_Pos)    /*!< 0x00000200 */
#define CRM_MISC3_HICK_TO_SCLK              CRM_MISC3_HICK_TO_SCLK_Msk              /*!< HICK as system clock frequency select */

/*!< HEXTDIV congiguration */
#define CRM_MISC3_HEXTDIV_Pos               (12U)
#define CRM_MISC3_HEXTDIV_Msk               (0x3U << CRM_MISC3_HEXTDIV_Pos)         /*!< 0x00003000 */
#define CRM_MISC3_HEXTDIV                   CRM_MISC3_HEXTDIV_Msk                   /*!< HEXTDIV[1:0] HEXT division */
#define CRM_MISC3_HEXTDIV_0                 (0x1U << CRM_MISC3_HEXTDIV_Pos)         /*!< 0x00001000 */
#define CRM_MISC3_HEXTDIV_1                 (0x2U << CRM_MISC3_HEXTDIV_Pos)         /*!< 0x00002000 */

#define CRM_MISC3_HEXTDIV_DIV2              0x00000000U                             /*!< HEXT clock is divided by 2 */
#define CRM_MISC3_HEXTDIV_DIV3              0x00001000U                             /*!< HEXT clock is divided by 3 */
#define CRM_MISC3_HEXTDIV_DIV4              0x00002000U                             /*!< HEXT clock is divided by 4 */
#define CRM_MISC3_HEXTDIV_DIV5              0x00003000U                             /*!< HEXT clock is divided by 5 */

