HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
/******************  Bit definition for FLASH_STS3 register *******************/
#define FLASH_STS3_OBF_Pos                  (0U)
#define FLASH_STS3_OBF_Msk                  (0x1U << FLASH_STS3_OBF_Pos)            /*!< 0x00000001 */
#define FLASH_STS3_OBF                      FLASH_STS3_OBF_Msk                      /*!< Operation busy flag */
#define FLASH_STS3_PRGMERR_Pos              (2U)
#define FLASH_STS3_PRGMERR_Msk              (0x1U << FLASH_STS3_PRGMERR_Pos)        /*!< 0x00000004 */
#define FLASH_STS3_PRGMERR                  FLASH_STS3_PRGMERR_Msk                  /*!< Programming error */
#define FLASH_STS3_EPPERR_Pos               (4U)
#define FLASH_STS3_EPPERR_Msk               (0x1U << FLASH_STS3_EPPERR_Pos)         /*!< 0x00000010 */
#define FLASH_STS3_EPPERR                   FLASH_STS3_EPPERR_Msk                   /*!< Erase/Program protection error */
#define FLASH_STS3_ODF_Pos                  (5U)
#define FLASH_STS3_ODF_Msk                  (0x1U << FLASH_STS3_ODF_Pos)            /*!< 0x00000020 */
#define FLASH_STS3_ODF                      FLASH_STS3_ODF_Msk                      /*!< Operation done flag */

/******************  Bit definition for FLASH_CTRL3 register ******************/
#define FLASH_CTRL3_FPRGM_Pos               (0U)
#define FLASH_CTRL3_FPRGM_Msk               (0x1U << FLASH_CTRL2_FPRGM_Pos)         /*!< 0x00000001 */
#define FLASH_CTRL3_FPRGM                   FLASH_CTRL2_FPRGM_Msk                   /*!< Flash program */
#define FLASH_CTRL3_SECERS_Pos              (1U)
#define FLASH_CTRL3_SECERS_Msk              (0x1U << FLASH_CTRL2_SECERS_Pos)        /*!< 0x00000002 */
#define FLASH_CTRL3_SECERS                  FLASH_CTRL2_SECERS_Msk                  /*!< Page erase */
#define FLASH_CTRL3_CHPERS_Pos              (2U)
#define FLASH_CTRL3_CHPERS_Msk              (0x1U << FLASH_CTRL3_CHPERS_Pos)        /*!< 0x00000004 */
#define FLASH_CTRL3_CHPERS                  FLASH_CTRL3_CHPERS_Msk                  /*!< Mass erase */
#define FLASH_CTRL3_ERSTR_Pos               (6U)
#define FLASH_CTRL3_ERSTR_Msk               (0x1U << FLASH_CTRL3_ERSTR_Pos)         /*!< 0x00000040 */
#define FLASH_CTRL3_ERSTR                   FLASH_CTRL3_ERSTR_Msk                   /*!< Erase start */
#define FLASH_CTRL3_OPLK_Pos                (7U)
#define FLASH_CTRL3_OPLK_Msk                (0x1U << FLASH_CTRL3_OPLK_Pos)          /*!< 0x00000080 */
#define FLASH_CTRL3_OPLK                    FLASH_CTRL3_OPLK_Msk                    /*!< Operation lock */
#define FLASH_CTRL3_ERRIE_Pos               (10U)
#define FLASH_CTRL3_ERRIE_Msk               (0x1U << FLASH_CTRL3_ERRIE_Pos)         /*!< 0x00000400 */
#define FLASH_CTRL3_ERRIE                   FLASH_CTRL3_ERRIE_Msk                   /*!< Error interrupt enable */
#define FLASH_CTRL3_ODFIE_Pos               (12U)
#define FLASH_CTRL3_ODFIE_Msk               (0x1U << FLASH_CTRL3_ODFIE_Pos)         /*!< 0x00001000 */
#define FLASH_CTRL3_ODFIE                   FLASH_CTRL3_ODFIE_Msk                   /*!< Operation done flag interrupt enable */

/******************  Bit definition for FLASH_ADDR3 register ******************/
#define FLASH_ADDR3_FA_Pos                  (0U)
#define FLASH_ADDR3_FA_Msk                  (0xFFFFFFFFU << FLASH_ADDR3_FA_Pos)     /*!< 0xFFFFFFFF */
#define FLASH_ADDR3_FA                      FLASH_ADDR3_FA_Msk                      /*!< Flash address */

/*******************  Bit definition for FLASH_DA register ********************/
#define FLASH_DA_FDA_Pos                    (0U)
#define FLASH_DA_FDA_Msk                    (0xFFFFFFFFU << FLASH_DA_FDA_Pos)       /*!< 0xFFFFFFFF */
#define FLASH_DA_FDA                        FLASH_DA_FDA_Msk                        /*!< Flash decryption address */

/*******************  Bit definition for SLIB_STS0 register *******************/
#define SLIB_STS0_SLIB_ENF_Pos              (3U)
#define SLIB_STS0_SLIB_ENF_Msk              (0x1U << SLIB_STS0_SLIB_ENF_Pos)        /*!< 0x00000008 */
#define SLIB_STS0_SLIB_ENF                  SLIB_STS0_SLIB_ENF_Msk                  /*!< Security library enable flag */

/*******************  Bit definition for SLIB_STS1 register *******************/
#define SLIB_STS1_SLIB_SS_Pos               (0U)
#define SLIB_STS1_SLIB_SS_Msk               (0x7FFU << SLIB_STS1_SLIB_SS_Pos)       /*!< 0x000007FF */
#define SLIB_STS1_SLIB_SS                   SLIB_STS1_SLIB_SS_Msk                   /*!< Security library start page */
#define SLIB_STS1_SLIB_DAT_SS_Pos           (11U)
#define SLIB_STS1_SLIB_DAT_SS_Msk           (0x3FF8U << SLIB_STS1_SLIB_DAT_SS_Pos)  /*!< 0x003FF800 */
#define SLIB_STS1_SLIB_DAT_SS               SLIB_STS1_SLIB_DAT_SS_Msk               /*!< Security library data start page */
#define SLIB_STS1_SLIB_ES_Pos               (22U)
#define SLIB_STS1_SLIB_ES_Msk               (0xFFCU << SLIB_STS1_SLIB_ES_Pos)       /*!< 0xFFC00000 */
#define SLIB_STS1_SLIB_ES                   SLIB_STS1_SLIB_ES_Msk                   /*!< Security library end page */

/*****************  Bit definition for SLIB_PWD_CLR register ******************/
#define SLIB_PWD_CLR_SLIB_PCLR_VAL_Pos      (0U)                                    /*!< 0xFFFFFFFF */
#define SLIB_PWD_CLR_SLIB_PCLR_VAL_Msk      (0xFFFFFFFFU << SLIB_PWD_CLR_SLIB_PCLR_VAL_Pos)
#define SLIB_PWD_CLR_SLIB_PCLR_VAL          SLIB_PWD_CLR_SLIB_PCLR_VAL_Msk          /*!< Security library password clear value */

/*****************  Bit definition for SLIB_MISC_STS register *****************/
#define SLIB_MISC_STS_SLIB_PWD_ERR_Pos      (0U)                                    /*!< 0x00000001 */
#define SLIB_MISC_STS_SLIB_PWD_ERR_Msk      (0x1U << SLIB_MISC_STS_SLIB_PWD_ERR_Pos)
#define SLIB_MISC_STS_SLIB_PWD_ERR          SLIB_MISC_STS_SLIB_PWD_ERR_Msk          /*!< Security library password error */
#define SLIB_MISC_STS_SLIB_PWD_OK_Pos       (1U)
#define SLIB_MISC_STS_SLIB_PWD_OK_Msk       (0x1U << SLIB_MISC_STS_SLIB_PWD_OK_Pos) /*!< 0x00000002 */
#define SLIB_MISC_STS_SLIB_PWD_OK           SLIB_MISC_STS_SLIB_PWD_OK_Msk           /*!< Security library password ok */
#define SLIB_MISC_STS_SLIB_ULKF_Pos         (2U)
#define SLIB_MISC_STS_SLIB_ULKF_Msk         (0x1U << SLIB_MISC_STS_SLIB_ULKF_Pos)   /*!< 0x00000004 */
#define SLIB_MISC_STS_SLIB_ULKF             SLIB_MISC_STS_SLIB_ULKF_Msk             /*!< Security library unlock flag */
#define SLIB_MISC_STS_SLIB_RCNT_Pos         (16U)
#define SLIB_MISC_STS_SLIB_RCNT_Msk         (0x1FFU << SLIB_MISC_STS_SLIB_RCNT_Pos) /*!< 0x01FF0000 */
#define SLIB_MISC_STS_SLIB_RCNT             SLIB_MISC_STS_SLIB_RCNT_Msk             /*!< Security library remaining count */

/*****************  Bit definition for SLIB_SET_PWD register ******************/
#define SLIB_SET_PWD_SLIB_PSET_VAL_Pos      (0U)                                    /*!< 0xFFFFFFFF */
#define SLIB_SET_PWD_SLIB_PSET_VAL_Msk      (0xFFFFFFFFU << SLIB_SET_PWD_SLIB_PSET_VAL_Pos)
#define SLIB_SET_PWD_SLIB_PSET_VAL          SLIB_SET_PWD_SLIB_PSET_VAL_Msk          /*!< Security library password setting value */

