HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
#define IOMUX_REMAP6_CAN2_GMUX_Pos          (4U)
#define IOMUX_REMAP6_CAN2_GMUX_Msk          (0xFU << IOMUX_REMAP6_CAN2_GMUX_Pos)    /*!< 0x000000F0 */
#define IOMUX_REMAP6_CAN2_GMUX              IOMUX_REMAP6_CAN2_GMUX_Msk              /*!< CAN2_GMUX[3:0] bits (CAN2 IO general multiplexing) */
#define IOMUX_REMAP6_CAN2_GMUX_0            (0x1U << IOMUX_REMAP6_CAN2_GMUX_Pos)    /*!< 0x00000010 */
#define IOMUX_REMAP6_CAN2_GMUX_1            (0x2U << IOMUX_REMAP6_CAN2_GMUX_Pos)    /*!< 0x00000020 */
#define IOMUX_REMAP6_CAN2_GMUX_2            (0x4U << IOMUX_REMAP6_CAN2_GMUX_Pos)    /*!< 0x00000040 */
#define IOMUX_REMAP6_CAN2_GMUX_3            (0x8U << IOMUX_REMAP6_CAN2_GMUX_Pos)    /*!< 0x00000080 */

#define IOMUX_REMAP6_SDIO2_GMUX_Pos         (12U)
#define IOMUX_REMAP6_SDIO2_GMUX_Msk         (0xFU << IOMUX_REMAP6_SDIO2_GMUX_Pos)   /*!< 0x0000F000 */
#define IOMUX_REMAP6_SDIO2_GMUX             IOMUX_REMAP6_SDIO2_GMUX_Msk             /*!< SDIO2_GMUX[3:0] bits (SDIO2 IO general multiplexing) */
#define IOMUX_REMAP6_SDIO2_GMUX_0           (0x1U << IOMUX_REMAP6_SDIO2_GMUX_Pos)   /*!< 0x00001000 */
#define IOMUX_REMAP6_SDIO2_GMUX_1           (0x2U << IOMUX_REMAP6_SDIO2_GMUX_Pos)   /*!< 0x00002000 */
#define IOMUX_REMAP6_SDIO2_GMUX_2           (0x4U << IOMUX_REMAP6_SDIO2_GMUX_Pos)   /*!< 0x00004000 */
#define IOMUX_REMAP6_SDIO2_GMUX_3           (0x8U << IOMUX_REMAP6_SDIO2_GMUX_Pos)   /*!< 0x00008000 */

#define IOMUX_REMAP6_USART1_GMUX_Pos        (16U)
#define IOMUX_REMAP6_USART1_GMUX_Msk        (0xFU << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x000F0000 */
#define IOMUX_REMAP6_USART1_GMUX            IOMUX_REMAP6_USART1_GMUX_Msk            /*!< USART1_GMUX[3:0] bits (USART1 IO general multiplexing) */
#define IOMUX_REMAP6_USART1_GMUX_0          (0x1U << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x00010000 */
#define IOMUX_REMAP6_USART1_GMUX_1          (0x2U << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x00020000 */
#define IOMUX_REMAP6_USART1_GMUX_2          (0x4U << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x00040000 */
#define IOMUX_REMAP6_USART1_GMUX_3          (0x8U << IOMUX_REMAP6_USART1_GMUX_Pos)  /*!< 0x00080000 */

#define IOMUX_REMAP6_USART2_GMUX_Pos        (20U)
#define IOMUX_REMAP6_USART2_GMUX_Msk        (0xFU << IOMUX_REMAP6_USART2_GMUX_Pos)  /*!< 0x00F00000 */
#define IOMUX_REMAP6_USART2_GMUX            IOMUX_REMAP6_USART2_GMUX_Msk            /*!< USART2_GMUX[3:0] bits (USART2 IO general multiplexing) */
#define IOMUX_REMAP6_USART2_GMUX_0          (0x1U << IOMUX_REMAP6_USART2_GMUX_Pos)  /*!< 0x00100000 */
#define IOMUX_REMAP6_USART2_GMUX_1          (0x2U << IOMUX_REMAP6_USART2_GMUX_Pos)  /*!< 0x00200000 */
#define IOMUX_REMAP6_USART2_GMUX_2          (0x4U << IOMUX_REMAP6_USART2_GMUX_Pos)  /*!< 0x00400000 */
#define IOMUX_REMAP6_USART2_GMUX_3          (0x8U << IOMUX_REMAP6_USART2_GMUX_Pos)  /*!< 0x00800000 */

/*!< USART3_GMUX configuration */
#define IOMUX_REMAP6_USART3_GMUX_Pos        (24U)
#define IOMUX_REMAP6_USART3_GMUX_Msk        (0xFU << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x0F000000 */
#define IOMUX_REMAP6_USART3_GMUX            IOMUX_REMAP6_USART3_GMUX_Msk            /*!< USART3_GMUX[3:0] bits (USART3 IO general multiplexing) */
#define IOMUX_REMAP6_USART3_GMUX_0          (0x1U << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x01000000 */
#define IOMUX_REMAP6_USART3_GMUX_1          (0x2U << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x02000000 */
#define IOMUX_REMAP6_USART3_GMUX_2          (0x4U << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x04000000 */
#define IOMUX_REMAP6_USART3_GMUX_3          (0x8U << IOMUX_REMAP6_USART3_GMUX_Pos)  /*!< 0x08000000 */

#define IOMUX_REMAP6_USART3_GMUX_MUX1       0x00000000U                             /*!< TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14 */
#define IOMUX_REMAP6_USART3_GMUX_MUX2_Pos   (24U)                                   /*!< 0x01000000 */
#define IOMUX_REMAP6_USART3_GMUX_MUX2_Msk   (0x1U << IOMUX_REMAP6_USART3_GMUX_MUX2_Pos)
#define IOMUX_REMAP6_USART3_GMUX_MUX2       IOMUX_REMAP6_USART3_GMUX_MUX2_Msk       /*!< TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14 */
#define IOMUX_REMAP6_USART3_GMUX_MUX3_Pos   (24U)                                   /*!< 0x03000000 */
#define IOMUX_REMAP6_USART3_GMUX_MUX3_Msk   (0x3U << IOMUX_REMAP6_USART3_GMUX_MUX3_Pos)
#define IOMUX_REMAP6_USART3_GMUX_MUX3       IOMUX_REMAP6_USART3_GMUX_MUX3_Msk       /*!< TX/PD8, RX/PD9, CK/PD10, CTS/PD11, RTS/PD12 */

#define IOMUX_REMAP6_UART4_GMUX_Pos         (28U)
#define IOMUX_REMAP6_UART4_GMUX_Msk         (0xFU << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0xF0000000 */
#define IOMUX_REMAP6_UART4_GMUX             IOMUX_REMAP6_UART4_GMUX_Msk             /*!< UART4_GMUX[3:0] bits (UART4 IO general multiplexing) */
#define IOMUX_REMAP6_UART4_GMUX_0           (0x1U << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0x10000000 */
#define IOMUX_REMAP6_UART4_GMUX_1           (0x2U << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0x20000000 */
#define IOMUX_REMAP6_UART4_GMUX_2           (0x4U << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0x40000000 */
#define IOMUX_REMAP6_UART4_GMUX_3           (0x8U << IOMUX_REMAP6_UART4_GMUX_Pos)   /*!< 0x80000000 */

/*****************  Bit definition for IOMUX_REMAP7 register  *****************/
#define IOMUX_REMAP7_EXT_SPIM_GMUX_Pos      (0U)
#define IOMUX_REMAP7_EXT_SPIM_GMUX_Msk      (0x7U << IOMUX_REMAP7_EXT_SPIM_GMUX_Pos) /*!< 0x00000007 */
#define IOMUX_REMAP7_EXT_SPIM_GMUX          IOMUX_REMAP7_EXT_SPIM_GMUX_Msk           /*!< EXT_SPIM_GMUX[2:0] bits (Select IO multiplexing for SPIM) */
#define IOMUX_REMAP7_EXT_SPIM_GMUX_0        (0x1U << IOMUX_REMAP7_EXT_SPIM_GMUX_Pos) /*!< 0x00000001 */
#define IOMUX_REMAP7_EXT_SPIM_GMUX_1        (0x2U << IOMUX_REMAP7_EXT_SPIM_GMUX_Pos) /*!< 0x00000002 */
#define IOMUX_REMAP7_EXT_SPIM_GMUX_2        (0x4U << IOMUX_REMAP7_EXT_SPIM_GMUX_Pos) /*!< 0x00000004 */

#define IOMUX_REMAP7_EXT_SPIM_GEN_Pos       (3U)
#define IOMUX_REMAP7_EXT_SPIM_GEN_Msk       (0x1U << IOMUX_REMAP7_EXT_SPIM_GEN_Pos) /*!< 0x00000008 */
#define IOMUX_REMAP7_EXT_SPIM_GEN           IOMUX_REMAP7_EXT_SPIM_GEN_Msk           /*!< SPIM enable */
#define IOMUX_REMAP7_ADC1_ETP_GMUX_Pos      (4U)                                    /*!< 0x00000010 */
#define IOMUX_REMAP7_ADC1_ETP_GMUX_Msk      (0x1U << IOMUX_REMAP7_ADC1_ETP_GMUX_Pos)
#define IOMUX_REMAP7_ADC1_ETP_GMUX          IOMUX_REMAP7_ADC1_ETP_GMUX_Msk          /*!< ADC1 External trigger preempted conversion general multiplexing */
#define IOMUX_REMAP7_ADC1_ETO_GMUX_Pos      (5U)                                    /*!< 0x00000020 */
#define IOMUX_REMAP7_ADC1_ETO_GMUX_Msk      (0x1U << IOMUX_REMAP7_ADC1_ETO_GMUX_Pos)
#define IOMUX_REMAP7_ADC1_ETO_GMUX          IOMUX_REMAP7_ADC1_ETO_GMUX_Msk          /*!< ADC1 external trigger regular conversion general multiplexing */
#define IOMUX_REMAP7_ADC2_ETP_GMUX_Pos      (8U)                                    /*!< 0x00000100 */
#define IOMUX_REMAP7_ADC2_ETP_GMUX_Msk      (0x1U << IOMUX_REMAP7_ADC2_ETP_GMUX_Pos)
#define IOMUX_REMAP7_ADC2_ETP_GMUX          IOMUX_REMAP7_ADC2_ETP_GMUX_Msk          /*!< ADC2 external trigger preempted conversion general multiplexing */
#define IOMUX_REMAP7_ADC2_ETO_GMUX_Pos      (9U)                                    /*!< 0x00000200 */
#define IOMUX_REMAP7_ADC2_ETO_GMUX_Msk      (0x1U << IOMUX_REMAP7_ADC2_ETO_GMUX_Pos)
#define IOMUX_REMAP7_ADC2_ETO_GMUX          IOMUX_REMAP7_ADC2_ETO_GMUX_Msk          /*!< ADC2 external trigger regular conversion general multiplexing */

/*!< SWJTAG_GMUX configuration */
#define IOMUX_REMAP7_SWJTAG_GMUX_Pos        (16U)
#define IOMUX_REMAP7_SWJTAG_GMUX_Msk        (0x7U << IOMUX_REMAP7_SWJTAG_GMUX_Pos)  /*!< 0x00070000 */
#define IOMUX_REMAP7_SWJTAG_GMUX            IOMUX_REMAP7_SWJTAG_GMUX_Msk            /*!< SWJTAG_GMUX[2:0] bits (SWD JTAG IO general mutiplexing) */
#define IOMUX_REMAP7_SWJTAG_GMUX_0          (0x1U << IOMUX_REMAP7_SWJTAG_GMUX_Pos)  /*!< 0x00010000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_1          (0x2U << IOMUX_REMAP7_SWJTAG_GMUX_Pos)  /*!< 0x00020000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_2          (0x4U << IOMUX_REMAP7_SWJTAG_GMUX_Pos)  /*!< 0x00040000 */

#define IOMUX_REMAP7_SWJTAG_GMUX_MUX1       0x00000000U                             /*!< Supports SWD and JTAG. All SWJTAG pins cannot be used as GPIO */
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX2_Pos   (16U)                                   /*!< 0x00010000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX2_Msk   (0x1U << IOMUX_REMAP7_SWJTAG_GMUX_MUX2_Pos)
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX2       IOMUX_REMAP7_SWJTAG_GMUX_MUX2_Msk       /*!< Supports SWD and JTAG. NJTRST is disabled. PB4 can be used as GPIO */
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX3_Pos   (17U)                                   /*!< 0x00020000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX3_Msk   (0x1U << IOMUX_REMAP7_SWJTAG_GMUX_MUX3_Pos)
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX3       IOMUX_REMAP7_SWJTAG_GMUX_MUX3_Msk       /*!< Supports SWD. But JTAG is disabled. PA15/PB3/PB4 can be used as GPIO */
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX4_Pos   (18U)                                   /*!< 0x00040000 */
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX4_Msk   (0x1U << IOMUX_REMAP7_SWJTAG_GMUX_MUX4_Pos)
#define IOMUX_REMAP7_SWJTAG_GMUX_MUX4       IOMUX_REMAP7_SWJTAG_GMUX_MUX4_Msk       /*!< SWD and JTAG are disabled. All SWJTAG pins can be used as GPIO */

#define IOMUX_REMAP7_PD01_GMUX_Pos          (20U)
#define IOMUX_REMAP7_PD01_GMUX_Msk          (0x1U << IOMUX_REMAP7_PD01_GMUX_Pos)    /*!< 0x00100000 */
#define IOMUX_REMAP7_PD01_GMUX              IOMUX_REMAP7_PD01_GMUX_Msk              /*!< PD0/PD1 mapped onto HEXT_IN / HEXT_OUT */

/*!< XMC_GMUX configuration */
#define IOMUX_REMAP7_XMC_GMUX_Pos           (24U)
#define IOMUX_REMAP7_XMC_GMUX_Msk           (0x7U << IOMUX_REMAP7_XMC_GMUX_Pos)     /*!< 0x07000000 */
#define IOMUX_REMAP7_XMC_GMUX               IOMUX_REMAP7_XMC_GMUX_Msk               /*!< XMC_GMUX[2:0] bits (XMC IO general multiplexing) */
#define IOMUX_REMAP7_XMC_GMUX_0             (0x1U << IOMUX_REMAP7_XMC_GMUX_Pos)     /*!< 0x01000000 */
#define IOMUX_REMAP7_XMC_GMUX_1             (0x2U << IOMUX_REMAP7_XMC_GMUX_Pos)     /*!< 0x02000000 */
#define IOMUX_REMAP7_XMC_GMUX_2             (0x4U << IOMUX_REMAP7_XMC_GMUX_Pos)     /*!< 0x04000000 */

