HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
/*******************  Bit definition for BPR_DT27 register  *******************/
#define BPR_DT27_DT_Pos                     (0U)
#define BPR_DT27_DT_Msk                     (0xFFFFU << BPR_DT27_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT27_DT                         BPR_DT27_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT28 register  *******************/
#define BPR_DT28_DT_Pos                     (0U)
#define BPR_DT28_DT_Msk                     (0xFFFFU << BPR_DT28_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT28_DT                         BPR_DT28_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT29 register  *******************/
#define BPR_DT29_DT_Pos                     (0U)
#define BPR_DT29_DT_Msk                     (0xFFFFU << BPR_DT29_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT29_DT                         BPR_DT29_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT30 register  *******************/
#define BPR_DT30_DT_Pos                     (0U)
#define BPR_DT30_DT_Msk                     (0xFFFFU << BPR_DT30_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT30_DT                         BPR_DT30_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT31 register  *******************/
#define BPR_DT31_DT_Pos                     (0U)
#define BPR_DT31_DT_Msk                     (0xFFFFU << BPR_DT31_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT31_DT                         BPR_DT31_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT32 register  *******************/
#define BPR_DT32_DT_Pos                     (0U)
#define BPR_DT32_DT_Msk                     (0xFFFFU << BPR_DT32_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT32_DT                         BPR_DT32_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT33 register  *******************/
#define BPR_DT33_DT_Pos                     (0U)
#define BPR_DT33_DT_Msk                     (0xFFFFU << BPR_DT33_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT33_DT                         BPR_DT33_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT34 register  *******************/
#define BPR_DT34_DT_Pos                     (0U)
#define BPR_DT34_DT_Msk                     (0xFFFFU << BPR_DT34_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT34_DT                         BPR_DT34_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT35 register  *******************/
#define BPR_DT35_DT_Pos                     (0U)
#define BPR_DT35_DT_Msk                     (0xFFFFU << BPR_DT35_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT35_DT                         BPR_DT35_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT36 register  *******************/
#define BPR_DT36_DT_Pos                     (0U)
#define BPR_DT36_DT_Msk                     (0xFFFFU << BPR_DT36_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT36_DT                         BPR_DT36_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT37 register  *******************/
#define BPR_DT37_DT_Pos                     (0U)
#define BPR_DT37_DT_Msk                     (0xFFFFU << BPR_DT37_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT37_DT                         BPR_DT37_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT38 register  *******************/
#define BPR_DT38_DT_Pos                     (0U)
#define BPR_DT38_DT_Msk                     (0xFFFFU << BPR_DT38_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT38_DT                         BPR_DT38_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT39 register  *******************/
#define BPR_DT39_DT_Pos                     (0U)
#define BPR_DT39_DT_Msk                     (0xFFFFU << BPR_DT39_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT39_DT                         BPR_DT39_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT40 register  *******************/
#define BPR_DT40_DT_Pos                     (0U)
#define BPR_DT40_DT_Msk                     (0xFFFFU << BPR_DT40_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT40_DT                         BPR_DT40_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT41 register  *******************/
#define BPR_DT41_DT_Pos                     (0U)
#define BPR_DT41_DT_Msk                     (0xFFFFU << BPR_DT41_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT41_DT                         BPR_DT41_DT_Msk                         /*!< Battery powered domain data */

/*******************  Bit definition for BPR_DT42 register  *******************/
#define BPR_DT42_DT_Pos                     (0U)
#define BPR_DT42_DT_Msk                     (0xFFFFU << BPR_DT42_DT_Pos)            /*!< 0x0000FFFF */
#define BPR_DT42_DT                         BPR_DT42_DT_Msk                         /*!< Battery powered domain data */

#define RTC_BPR_NUMBER 42

/******************  Bit definition for BPR_RTCCAL register  ******************/
#define BPR_RTCCAL_CALVAL_Pos               (0U)
#define BPR_RTCCAL_CALVAL_Msk               (0x7FU << BPR_RTCCAL_CALVAL_Pos)        /*!< 0x0000007F */
#define BPR_RTCCAL_CALVAL                   BPR_RTCCAL_CALVAL_Msk                   /*!< Calibration value */
#define BPR_RTCCAL_CALOUT_Pos               (7U)
#define BPR_RTCCAL_CALOUT_Msk               (0x1U << BPR_RTCCAL_CALOUT_Pos)         /*!< 0x00000080 */
#define BPR_RTCCAL_CALOUT                   BPR_RTCCAL_CALOUT_Msk                   /*!< Calibration clock output */
#define BPR_RTCCAL_OUTEN_Pos                (8U)
#define BPR_RTCCAL_OUTEN_Msk                (0x1U << BPR_RTCCAL_OUTEN_Pos)          /*!< 0x00000100 */
#define BPR_RTCCAL_OUTEN                    BPR_RTCCAL_OUTEN_Msk                    /*!< Output enable */
#define BPR_RTCCAL_OUTSEL_Pos               (9U)
#define BPR_RTCCAL_OUTSEL_Msk               (0x1U << BPR_RTCCAL_OUTSEL_Pos)         /*!< 0x00000200 */
#define BPR_RTCCAL_OUTSEL                   BPR_RTCCAL_OUTSEL_Msk                   /*!< Output selection */
#define BPR_RTCCAL_CCOS_Pos                 (10U)
#define BPR_RTCCAL_CCOS_Msk                 (0x1U << BPR_RTCCAL_CCOS_Pos)           /*!< 0x00000400 */
#define BPR_RTCCAL_CCOS                     BPR_RTCCAL_CCOS_Msk                     /*!< Calibration clock output selection */
#define BPR_RTCCAL_OUTM_Pos                 (11U)
#define BPR_RTCCAL_OUTM_Msk                 (0x1U << BPR_RTCCAL_OUTM_Pos)           /*!< 0x00000800 */
#define BPR_RTCCAL_OUTM                     BPR_RTCCAL_OUTM_Msk                     /*!< Output mode */

