HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
/******************  Bit definition for CAN_F13FB2 register  ******************/
#define CAN_F13FB2_FFDB0_Pos                (0U)
#define CAN_F13FB2_FFDB0_Msk                (0x1U << CAN_F13FB2_FFDB0_Pos)          /*!< 0x00000001 */
#define CAN_F13FB2_FFDB0                    CAN_F13FB2_FFDB0_Msk                    /*!< Filter data bit 0 */
#define CAN_F13FB2_FFDB1_Pos                (1U)
#define CAN_F13FB2_FFDB1_Msk                (0x1U << CAN_F13FB2_FFDB1_Pos)          /*!< 0x00000002 */
#define CAN_F13FB2_FFDB1                    CAN_F13FB2_FFDB1_Msk                    /*!< Filter data bit 1 */
#define CAN_F13FB2_FFDB2_Pos                (2U)
#define CAN_F13FB2_FFDB2_Msk                (0x1U << CAN_F13FB2_FFDB2_Pos)          /*!< 0x00000004 */
#define CAN_F13FB2_FFDB2                    CAN_F13FB2_FFDB2_Msk                    /*!< Filter data bit 2 */
#define CAN_F13FB2_FFDB3_Pos                (3U)
#define CAN_F13FB2_FFDB3_Msk                (0x1U << CAN_F13FB2_FFDB3_Pos)          /*!< 0x00000008 */
#define CAN_F13FB2_FFDB3                    CAN_F13FB2_FFDB3_Msk                    /*!< Filter data bit 3 */
#define CAN_F13FB2_FFDB4_Pos                (4U)
#define CAN_F13FB2_FFDB4_Msk                (0x1U << CAN_F13FB2_FFDB4_Pos)          /*!< 0x00000010 */
#define CAN_F13FB2_FFDB4                    CAN_F13FB2_FFDB4_Msk                    /*!< Filter data bit 4 */
#define CAN_F13FB2_FFDB5_Pos                (5U)
#define CAN_F13FB2_FFDB5_Msk                (0x1U << CAN_F13FB2_FFDB5_Pos)          /*!< 0x00000020 */
#define CAN_F13FB2_FFDB5                    CAN_F13FB2_FFDB5_Msk                    /*!< Filter data bit 5 */
#define CAN_F13FB2_FFDB6_Pos                (6U)
#define CAN_F13FB2_FFDB6_Msk                (0x1U << CAN_F13FB2_FFDB6_Pos)          /*!< 0x00000040 */
#define CAN_F13FB2_FFDB6                    CAN_F13FB2_FFDB6_Msk                    /*!< Filter data bit 6 */
#define CAN_F13FB2_FFDB7_Pos                (7U)
#define CAN_F13FB2_FFDB7_Msk                (0x1U << CAN_F13FB2_FFDB7_Pos)          /*!< 0x00000080 */
#define CAN_F13FB2_FFDB7                    CAN_F13FB2_FFDB7_Msk                    /*!< Filter data bit 7 */
#define CAN_F13FB2_FFDB8_Pos                (8U)
#define CAN_F13FB2_FFDB8_Msk                (0x1U << CAN_F13FB2_FFDB8_Pos)          /*!< 0x00000100 */
#define CAN_F13FB2_FFDB8                    CAN_F13FB2_FFDB8_Msk                    /*!< Filter data bit 8 */
#define CAN_F13FB2_FFDB9_Pos                (9U)
#define CAN_F13FB2_FFDB9_Msk                (0x1U << CAN_F13FB2_FFDB9_Pos)          /*!< 0x00000200 */
#define CAN_F13FB2_FFDB9                    CAN_F13FB2_FFDB9_Msk                    /*!< Filter data bit 9 */
#define CAN_F13FB2_FFDB10_Pos               (10U)
#define CAN_F13FB2_FFDB10_Msk               (0x1U << CAN_F13FB2_FFDB10_Pos)         /*!< 0x00000400 */
#define CAN_F13FB2_FFDB10                   CAN_F13FB2_FFDB10_Msk                   /*!< Filter data bit 10 */
#define CAN_F13FB2_FFDB11_Pos               (11U)
#define CAN_F13FB2_FFDB11_Msk               (0x1U << CAN_F13FB2_FFDB11_Pos)         /*!< 0x00000800 */
#define CAN_F13FB2_FFDB11                   CAN_F13FB2_FFDB11_Msk                   /*!< Filter data bit 11 */
#define CAN_F13FB2_FFDB12_Pos               (12U)
#define CAN_F13FB2_FFDB12_Msk               (0x1U << CAN_F13FB2_FFDB12_Pos)         /*!< 0x00001000 */
#define CAN_F13FB2_FFDB12                   CAN_F13FB2_FFDB12_Msk                   /*!< Filter data bit 12 */
#define CAN_F13FB2_FFDB13_Pos               (13U)
#define CAN_F13FB2_FFDB13_Msk               (0x1U << CAN_F13FB2_FFDB13_Pos)         /*!< 0x00002000 */
#define CAN_F13FB2_FFDB13                   CAN_F13FB2_FFDB13_Msk                   /*!< Filter data bit 13 */
#define CAN_F13FB2_FFDB14_Pos               (14U)
#define CAN_F13FB2_FFDB14_Msk               (0x1U << CAN_F13FB2_FFDB14_Pos)         /*!< 0x00004000 */
#define CAN_F13FB2_FFDB14                   CAN_F13FB2_FFDB14_Msk                   /*!< Filter data bit 14 */
#define CAN_F13FB2_FFDB15_Pos               (15U)
#define CAN_F13FB2_FFDB15_Msk               (0x1U << CAN_F13FB2_FFDB15_Pos)         /*!< 0x00008000 */
#define CAN_F13FB2_FFDB15                   CAN_F13FB2_FFDB15_Msk                   /*!< Filter data bit 15 */
#define CAN_F13FB2_FFDB16_Pos               (16U)
#define CAN_F13FB2_FFDB16_Msk               (0x1U << CAN_F13FB2_FFDB16_Pos)         /*!< 0x00010000 */
#define CAN_F13FB2_FFDB16                   CAN_F13FB2_FFDB16_Msk                   /*!< Filter data bit 16 */
#define CAN_F13FB2_FFDB17_Pos               (17U)
#define CAN_F13FB2_FFDB17_Msk               (0x1U << CAN_F13FB2_FFDB17_Pos)         /*!< 0x00020000 */
#define CAN_F13FB2_FFDB17                   CAN_F13FB2_FFDB17_Msk                   /*!< Filter data bit 17 */
#define CAN_F13FB2_FFDB18_Pos               (18U)
#define CAN_F13FB2_FFDB18_Msk               (0x1U << CAN_F13FB2_FFDB18_Pos)         /*!< 0x00040000 */
#define CAN_F13FB2_FFDB18                   CAN_F13FB2_FFDB18_Msk                   /*!< Filter data bit 18 */
#define CAN_F13FB2_FFDB19_Pos               (19U)
#define CAN_F13FB2_FFDB19_Msk               (0x1U << CAN_F13FB2_FFDB19_Pos)         /*!< 0x00080000 */
#define CAN_F13FB2_FFDB19                   CAN_F13FB2_FFDB19_Msk                   /*!< Filter data bit 19 */
#define CAN_F13FB2_FFDB20_Pos               (20U)
#define CAN_F13FB2_FFDB20_Msk               (0x1U << CAN_F13FB2_FFDB20_Pos)         /*!< 0x00100000 */
#define CAN_F13FB2_FFDB20                   CAN_F13FB2_FFDB20_Msk                   /*!< Filter data bit 20 */
#define CAN_F13FB2_FFDB21_Pos               (21U)
#define CAN_F13FB2_FFDB21_Msk               (0x1U << CAN_F13FB2_FFDB21_Pos)         /*!< 0x00200000 */
#define CAN_F13FB2_FFDB21                   CAN_F13FB2_FFDB21_Msk                   /*!< Filter data bit 21 */
#define CAN_F13FB2_FFDB22_Pos               (22U)
#define CAN_F13FB2_FFDB22_Msk               (0x1U << CAN_F13FB2_FFDB22_Pos)         /*!< 0x00400000 */
#define CAN_F13FB2_FFDB22                   CAN_F13FB2_FFDB22_Msk                   /*!< Filter data bit 22 */
#define CAN_F13FB2_FFDB23_Pos               (23U)
#define CAN_F13FB2_FFDB23_Msk               (0x1U << CAN_F13FB2_FFDB23_Pos)         /*!< 0x00800000 */
#define CAN_F13FB2_FFDB23                   CAN_F13FB2_FFDB23_Msk                   /*!< Filter data bit 23 */
#define CAN_F13FB2_FFDB24_Pos               (24U)
#define CAN_F13FB2_FFDB24_Msk               (0x1U << CAN_F13FB2_FFDB24_Pos)         /*!< 0x01000000 */
#define CAN_F13FB2_FFDB24                   CAN_F13FB2_FFDB24_Msk                   /*!< Filter data bit 24 */
#define CAN_F13FB2_FFDB25_Pos               (25U)
#define CAN_F13FB2_FFDB25_Msk               (0x1U << CAN_F13FB2_FFDB25_Pos)         /*!< 0x02000000 */
#define CAN_F13FB2_FFDB25                   CAN_F13FB2_FFDB25_Msk                   /*!< Filter data bit 25 */
#define CAN_F13FB2_FFDB26_Pos               (26U)
#define CAN_F13FB2_FFDB26_Msk               (0x1U << CAN_F13FB2_FFDB26_Pos)         /*!< 0x04000000 */
#define CAN_F13FB2_FFDB26                   CAN_F13FB2_FFDB26_Msk                   /*!< Filter data bit 26 */
#define CAN_F13FB2_FFDB27_Pos               (27U)
#define CAN_F13FB2_FFDB27_Msk               (0x1U << CAN_F13FB2_FFDB27_Pos)         /*!< 0x08000000 */
#define CAN_F13FB2_FFDB27                   CAN_F13FB2_FFDB27_Msk                   /*!< Filter data bit 27 */
#define CAN_F13FB2_FFDB28_Pos               (28U)
#define CAN_F13FB2_FFDB28_Msk               (0x1U << CAN_F13FB2_FFDB28_Pos)         /*!< 0x10000000 */
#define CAN_F13FB2_FFDB28                   CAN_F13FB2_FFDB28_Msk                   /*!< Filter data bit 28 */
#define CAN_F13FB2_FFDB29_Pos               (29U)
#define CAN_F13FB2_FFDB29_Msk               (0x1U << CAN_F13FB2_FFDB29_Pos)         /*!< 0x20000000 */
#define CAN_F13FB2_FFDB29                   CAN_F13FB2_FFDB29_Msk                   /*!< Filter data bit 29 */
#define CAN_F13FB2_FFDB30_Pos               (30U)
#define CAN_F13FB2_FFDB30_Msk               (0x1U << CAN_F13FB2_FFDB30_Pos)         /*!< 0x40000000 */
#define CAN_F13FB2_FFDB30                   CAN_F13FB2_FFDB30_Msk                   /*!< Filter data bit 30 */
#define CAN_F13FB2_FFDB31_Pos               (31U)
#define CAN_F13FB2_FFDB31_Msk               (0x1U << CAN_F13FB2_FFDB31_Pos)         /*!< 0x80000000 */
#define CAN_F13FB2_FFDB31                   CAN_F13FB2_FFDB31_Msk                   /*!< Filter data bit 31 */

/******************************************************************************/
/*                                                                            */
/*                      External memory controller (XMC)                      */
/*                                                                            */
/******************************************************************************/

/**********  Bit definition for XMC_BK1CTRLx (x = 1 or 4) register  ***********/
#define XMC_BK1CTRLx_EN_Pos                 (0U)
#define XMC_BK1CTRLx_EN_Msk                 (0x1U << XMC_BK1CTRLx_EN_Pos)           /*!< 0x00000001 */
#define XMC_BK1CTRLx_EN                     XMC_BK1CTRLx_EN_Msk                     /*!< Memory bank enable */
#define XMC_BK1CTRLx_ADMUXEN_Pos            (1U)
#define XMC_BK1CTRLx_ADMUXEN_Msk            (0x1U << XMC_BK1CTRLx_ADMUXEN_Pos)      /*!< 0x00000002 */
#define XMC_BK1CTRLx_ADMUXEN                XMC_BK1CTRLx_ADMUXEN_Msk                /*!< Address/data multiplexing enable */

#define XMC_BK1CTRLx_DEV_Pos                (2U)
#define XMC_BK1CTRLx_DEV_Msk                (0x3U << XMC_BK1CTRLx_DEV_Pos)          /*!< 0x0000000C */
#define XMC_BK1CTRLx_DEV                    XMC_BK1CTRLx_DEV_Msk                    /*!< DEV[1:0] bits (Memory device type) */
#define XMC_BK1CTRLx_DEV_0                  (0x1U << XMC_BK1CTRLx_DEV_Pos)          /*!< 0x00000004 */
#define XMC_BK1CTRLx_DEV_1                  (0x2U << XMC_BK1CTRLx_DEV_Pos)          /*!< 0x00000008 */

#define XMC_BK1CTRLx_EXTMDBW_Pos            (4U)
#define XMC_BK1CTRLx_EXTMDBW_Msk            (0x3U << XMC_BK1CTRLx_EXTMDBW_Pos)      /*!< 0x00000030 */
#define XMC_BK1CTRLx_EXTMDBW                XMC_BK1CTRLx_EXTMDBW_Msk                /*!< EXTMDBW[1:0] bits (External memory data bus width) */
#define XMC_BK1CTRLx_EXTMDBW_0              (0x1U << XMC_BK1CTRLx_EXTMDBW_Pos)      /*!< 0x00000010 */
#define XMC_BK1CTRLx_EXTMDBW_1              (0x2U << XMC_BK1CTRLx_EXTMDBW_Pos)      /*!< 0x00000020 */

#define XMC_BK1CTRLx_NOREN_Pos              (6U)
#define XMC_BK1CTRLx_NOREN_Msk              (0x1U << XMC_BK1CTRLx_NOREN_Pos)        /*!< 0x00000040 */
#define XMC_BK1CTRLx_NOREN                  XMC_BK1CTRLx_NOREN_Msk                  /*!< NOR flash access enable */
#define XMC_BK1CTRLx_SYNCBEN_Pos            (8U)
#define XMC_BK1CTRLx_SYNCBEN_Msk            (0x1U << XMC_BK1CTRLx_SYNCBEN_Pos)      /*!< 0x00000100 */
#define XMC_BK1CTRLx_SYNCBEN                XMC_BK1CTRLx_SYNCBEN_Msk                /*!< Synchronous burst enable */
#define XMC_BK1CTRLx_NWPOL_Pos              (9U)
#define XMC_BK1CTRLx_NWPOL_Msk              (0x1U << XMC_BK1CTRLx_NWPOL_Pos)        /*!< 0x00000200 */
#define XMC_BK1CTRLx_NWPOL                  XMC_BK1CTRLx_NWPOL_Msk                  /*!< NWAIT polarity */
#define XMC_BK1CTRLx_WRAPEN_Pos             (10U)
#define XMC_BK1CTRLx_WRAPEN_Msk             (0x1U << XMC_BK1CTRLx_WRAPEN_Pos)       /*!< 0x00000400 */
#define XMC_BK1CTRLx_WRAPEN                 XMC_BK1CTRLx_WRAPEN_Msk                 /*!< Wrapped enable */
#define XMC_BK1CTRLx_NWTCFG_Pos             (11U)
#define XMC_BK1CTRLx_NWTCFG_Msk             (0x1U << XMC_BK1CTRLx_NWTCFG_Pos)       /*!< 0x00000800 */
#define XMC_BK1CTRLx_NWTCFG                 XMC_BK1CTRLx_NWTCFG_Msk                 /*!< NWAIT timing configuration */
#define XMC_BK1CTRLx_WEN_Pos                (12U)
#define XMC_BK1CTRLx_WEN_Msk                (0x1U << XMC_BK1CTRLx_WEN_Pos)          /*!< 0x00001000 */
#define XMC_BK1CTRLx_WEN                    XMC_BK1CTRLx_WEN_Msk                    /*!< Write enable */
#define XMC_BK1CTRLx_NWSEN_Pos              (13U)
#define XMC_BK1CTRLx_NWSEN_Msk              (0x1U << XMC_BK1CTRLx_NWSEN_Pos)        /*!< 0x00002000 */
#define XMC_BK1CTRLx_NWSEN                  XMC_BK1CTRLx_NWSEN_Msk                  /*!< NWAIT enable during synchronous transfer */
#define XMC_BK1CTRLx_RWTD_Pos               (14U)
#define XMC_BK1CTRLx_RWTD_Msk               (0x1U << XMC_BK1CTRLx_RWTD_Pos)         /*!< 0x00004000 */
#define XMC_BK1CTRLx_RWTD                   XMC_BK1CTRLx_RWTD_Msk                   /*!< Read-write timing different */
#define XMC_BK1CTRLx_NWASEN_Pos             (15U)
#define XMC_BK1CTRLx_NWASEN_Msk             (0x1U << XMC_BK1CTRLx_NWASEN_Pos)       /*!< 0x00008000 */
#define XMC_BK1CTRLx_NWASEN                 XMC_BK1CTRLx_NWASEN_Msk                 /*!< NWAIT enable during asynchronous transfer */

// Unused (Default no burst split using)
// #define XMC_BK1CTRLx_CRPGS_Pos           (16U)
// #define XMC_BK1CTRLx_CRPGS_Msk           (0x7U << XMC_BK1CTRLx_CRPGS_Pos)        /*!< 0x00070000 */
// #define XMC_BK1CTRLx_CRPGS               XMC_BK1CTRLx_CRPGS_Msk                  /*!< CRPGS[2:0] bits (CRAM page size) */
// #define XMC_BK1CTRLx_CRPGS_0             (0x1U << XMC_BK1CTRLx_CRPGS_Pos)        /*!< 0x00010000 */
// #define XMC_BK1CTRLx_CRPGS_1             (0x2U << XMC_BK1CTRLx_CRPGS_Pos)        /*!< 0x00020000 */
// #define XMC_BK1CTRLx_CRPGS_2             (0x4U << XMC_BK1CTRLx_CRPGS_Pos)        /*!< 0x00040000 */

#define XMC_BK1CTRLx_MWMC_Pos               (19U)
#define XMC_BK1CTRLx_MWMC_Msk               (0x1U << XMC_BK1CTRLx_MWMC_Pos)         /*!< 0x00080000 */
#define XMC_BK1CTRLx_MWMC                   XMC_BK1CTRLx_MWMC_Msk                   /*!< Memory write mode control */

/***********  Bit definition for XMC_BK1TMGx (x = 1 or 4) register  ***********/
#define XMC_BK1TMGx_ADDRST_Pos              (0U)
#define XMC_BK1TMGx_ADDRST_Msk              (0xFU << XMC_BK1TMGx_ADDRST_Pos)        /*!< 0x0000000F */
#define XMC_BK1TMGx_ADDRST                  XMC_BK1TMGx_ADDRST_Msk                  /*!< ADDRST[3:0] bits (Address setup time) */
#define XMC_BK1TMGx_ADDRST_0                (0x1U << XMC_BK1TMGx_ADDRST_Pos)        /*!< 0x00000001 */
#define XMC_BK1TMGx_ADDRST_1                (0x2U << XMC_BK1TMGx_ADDRST_Pos)        /*!< 0x00000002 */
#define XMC_BK1TMGx_ADDRST_2                (0x4U << XMC_BK1TMGx_ADDRST_Pos)        /*!< 0x00000004 */
#define XMC_BK1TMGx_ADDRST_3                (0x8U << XMC_BK1TMGx_ADDRST_Pos)        /*!< 0x00000008 */

#define XMC_BK1TMGx_ADDRHT_Pos              (4U)
#define XMC_BK1TMGx_ADDRHT_Msk              (0xFU << XMC_BK1TMGx_ADDRHT_Pos)        /*!< 0x000000F0 */
#define XMC_BK1TMGx_ADDRHT                  XMC_BK1TMGx_ADDRHT_Msk                  /*!< ADDRHT[3:0] bits (Address-hold time) */
#define XMC_BK1TMGx_ADDRHT_0                (0x1U << XMC_BK1TMGx_ADDRHT_Pos)        /*!< 0x00000010 */
#define XMC_BK1TMGx_ADDRHT_1                (0x2U << XMC_BK1TMGx_ADDRHT_Pos)        /*!< 0x00000020 */
#define XMC_BK1TMGx_ADDRHT_2                (0x4U << XMC_BK1TMGx_ADDRHT_Pos)        /*!< 0x00000040 */
#define XMC_BK1TMGx_ADDRHT_3                (0x8U << XMC_BK1TMGx_ADDRHT_Pos)        /*!< 0x00000080 */

#define XMC_BK1TMGx_DTST_Pos                (8U)
#define XMC_BK1TMGx_DTST_Msk                (0xFFU << XMC_BK1TMGx_DTST_Pos)         /*!< 0x0000FF00 */
#define XMC_BK1TMGx_DTST                    XMC_BK1TMGx_DTST_Msk                    /*!< DTST[7:0] bits (Data setup time) */
#define XMC_BK1TMGx_DTST_0                  (0x01U << XMC_BK1TMGx_DTST_Pos)         /*!< 0x00000100 */
#define XMC_BK1TMGx_DTST_1                  (0x02U << XMC_BK1TMGx_DTST_Pos)         /*!< 0x00000200 */
#define XMC_BK1TMGx_DTST_2                  (0x04U << XMC_BK1TMGx_DTST_Pos)         /*!< 0x00000400 */
#define XMC_BK1TMGx_DTST_3                  (0x08U << XMC_BK1TMGx_DTST_Pos)         /*!< 0x00000800 */
#define XMC_BK1TMGx_DTST_4                  (0x10U << XMC_BK1TMGx_DTST_Pos)         /*!< 0x00001000 */
#define XMC_BK1TMGx_DTST_5                  (0x20U << XMC_BK1TMGx_DTST_Pos)         /*!< 0x00002000 */
#define XMC_BK1TMGx_DTST_6                  (0x40U << XMC_BK1TMGx_DTST_Pos)         /*!< 0x00004000 */
#define XMC_BK1TMGx_DTST_7                  (0x80U << XMC_BK1TMGx_DTST_Pos)         /*!< 0x00008000 */

#define XMC_BK1TMGx_BUSLAT_Pos              (16U)
#define XMC_BK1TMGx_BUSLAT_Msk              (0xFU << XMC_BK1TMGx_BUSLAT_Pos)        /*!< 0x000F0000 */
#define XMC_BK1TMGx_BUSLAT                  XMC_BK1TMGx_BUSLAT_Msk                  /*!< BUSLAT[3:0] bits (Bus latency) */
#define XMC_BK1TMGx_BUSLAT_0                (0x1U << XMC_BK1TMGx_BUSLAT_Pos)        /*!< 0x00010000 */
#define XMC_BK1TMGx_BUSLAT_1                (0x2U << XMC_BK1TMGx_BUSLAT_Pos)        /*!< 0x00020000 */
#define XMC_BK1TMGx_BUSLAT_2                (0x4U << XMC_BK1TMGx_BUSLAT_Pos)        /*!< 0x00040000 */
#define XMC_BK1TMGx_BUSLAT_3                (0x8U << XMC_BK1TMGx_BUSLAT_Pos)        /*!< 0x00080000 */

#define XMC_BK1TMGx_CLKPSC_Pos              (20U)
#define XMC_BK1TMGx_CLKPSC_Msk              (0xFU << XMC_BK1TMGx_CLKPSC_Pos)        /*!< 0x00F00000 */
#define XMC_BK1TMGx_CLKPSC                  XMC_BK1TMGx_CLKPSC_Msk                  /*!< CLKPSC[3:0] bits (Clock prescaler) */
#define XMC_BK1TMGx_CLKPSC_0                (0x1U << XMC_BK1TMGx_CLKPSC_Pos)        /*!< 0x00100000 */
#define XMC_BK1TMGx_CLKPSC_1                (0x2U << XMC_BK1TMGx_CLKPSC_Pos)        /*!< 0x00200000 */
#define XMC_BK1TMGx_CLKPSC_2                (0x4U << XMC_BK1TMGx_CLKPSC_Pos)        /*!< 0x00400000 */
#define XMC_BK1TMGx_CLKPSC_3                (0x8U << XMC_BK1TMGx_CLKPSC_Pos)        /*!< 0x00800000 */

