HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
/* Bit positions */
#define USB_EP_RXTC_Pos                     (15U)
#define USB_EP_RXTC_Msk                     (0x1U << USB_EP_RXTC_Pos)               /*!< 0x00008000 */
#define USB_EP_RXTC                         USB_EP_RXTC_Msk                         /*!< Endpoint Rx transaction */
#define USB_EP_RXDTS_Pos                    (14U)
#define USB_EP_RXDTS_Msk                    (0x1U << USB_EP_RXDTS_Pos)              /*!< 0x00004000 */
#define USB_EP_RXDTS                        USB_EP_RXDTS_Msk                        /*!< Endpoint Rx data toggle */
#define USB_EPRX_STS_Pos                    (12U)
#define USB_EPRX_STS_Msk                    (0x3U << USB_EPRX_STS_Pos)              /*!< 0x00003000 */
#define USB_EPRX_STS                        USB_EPRX_STS_Msk                        /*!< Endpoint Rx status */
#define USB_EP_SETUPTC_Pos                  (11U)
#define USB_EP_SETUPTC_Msk                  (0x1U << USB_EP_SETUPTC_Pos)            /*!< 0x00000800 */
#define USB_EP_SETUPTC                      USB_EP_SETUPTC_Msk                      /*!< Endpoint setup transaction */
#define USB_EP_TT_FIELD_Pos                 (9U)
#define USB_EP_TT_FIELD_Msk                 (0x3U << USB_EP_TT_FIELD_Pos)           /*!< 0x00000600 */
#define USB_EP_TT_FIELD                     USB_EP_TT_FIELD_Msk                     /*!< Endpoint transfer type */
#define USB_EP_EXF_Pos                      (8U)
#define USB_EP_EXF_Msk                      (0x1U << USB_EP_EXF_Pos)                /*!< 0x00000100 */
#define USB_EP_EXF                          USB_EP_EXF_Msk                          /*!< Endpoint extend function */
#define USB_EP_TXTC_Pos                     (7U)
#define USB_EP_TXTC_Msk                     (0x1U << USB_EP_TXTC_Pos)               /*!< 0x00000080 */
#define USB_EP_TXTC                         USB_EP_TXTC_Msk                         /*!< Endpoint Tx transaction */
#define USB_EP_TXDTS_Pos                    (6U)
#define USB_EP_TXDTS_Msk                    (0x1U << USB_EP_TXDTS_Pos)              /*!< 0x00000040 */
#define USB_EP_TXDTS                        USB_EP_TXDTS_Msk                        /*!< Endpoint Tx data toggle */
#define USB_EPTX_STS_Pos                    (4U)
#define USB_EPTX_STS_Msk                    (0x3U << USB_EPTX_STS_Pos)              /*!< 0x00000030 */
#define USB_EPTX_STS                        USB_EPTX_STS_Msk                        /*!< Endpoint Tx status */
#define USB_EPTADDR_FIELD_Pos               (0U)
#define USB_EPTADDR_FIELD_Msk               (0xFU << USB_EPTADDR_FIELD_Pos)         /*!< 0x0000000F */
#define USB_EPTADDR_FIELD                   USB_EPTADDR_FIELD_Msk                   /*!< Endpoint address */

/* Endpoint Register MASK (no toggle fields) */
#define USB_EPREG_MASK                      (USB_EP_RXTC|USB_EP_SETUPTC|USB_EP_TT_FIELD|USB_EP_EXF|USB_EP_TXTC|USB_EPTADDR_FIELD)

                                                                                    /*!< TRANS_TYPE[1:0] Endpoint transfer type */
#define USB_EP_TTYPE_MASK_Pos               (9U)                           
#define USB_EP_TTYPE_MASK_Msk               (0x3U << USB_EP_TTYPE_MASK_Pos)         /*!< 0x00000600 */
#define USB_EP_TTYPE_MASK                   USB_EP_TTYPE_MASK_Msk                   /*!< Endpoint transfer type Mask */
#define USB_EP_BULK                         0x00000000U                             /*!< Endpoint BULK */
#define USB_EP_CTRL                         0x00000200U                             /*!< Endpoint CTRL */
#define USB_EP_ISO                          0x00000400U                             /*!< Endpoint ISO */
#define USB_EP_INT                          0x00000600U                             /*!< Endpoint INT */
#define USB_EP_TT_MASK                      (~USB_EP_TT_FIELD & USB_EPREG_MASK)

#define USB_EPEXF_MASK                      (~USB_EP_EXF & USB_EPREG_MASK)          /*!< EXF Endpoint extend function */

                                                                                    /*!< TXSTS[1:0] Status for Tx transfer */
#define USB_EP_TX_DIS                       0x00000000U                             /*!< Endpoint Tx DISABLED */
#define USB_EP_TX_STALL                     0x00000010U                             /*!< Endpoint Tx STALL */
#define USB_EP_TX_NAK                       0x00000020U                             /*!< Endpoint Tx NAK */
#define USB_EP_TX_VALID                     0x00000030U                             /*!< Endpoint Tx VALID */
#define USB_EPTX_DTS1                       0x00000010U                             /*!< Endpoint Tx data toggle bit 1 */
#define USB_EPTX_DTS2                       0x00000020U                             /*!< Endpoint Tx data toggle bit 2 */
#define USB_EPTX_DTSMASK                    (USB_EPTX_STS|USB_EPREG_MASK)

                                                                                    /*!< RXSTS[1:0] Status for Rx transfer */
#define USB_EP_RX_DIS                       0x00000000U                             /*!< Endpoint Rx DISABLED */
#define USB_EP_RX_STALL                     0x00001000U                             /*!< Endpoint Rx STALL */
#define USB_EP_RX_NAK                       0x00002000U                             /*!< Endpoint Rx NAK */
#define USB_EP_RX_VALID                     0x00003000U                             /*!< Endpoint Rx VALID */
#define USB_EPRX_DTS1                       0x00001000U                             /*!< Endpoint Rx data toggle bit 1 */
#define USB_EPRX_DTS2                       0x00002000U                             /*!< Endpoint Rx data toggle bit 2 */
#define USB_EPRX_DTSMASK                    (USB_EPRX_STS|USB_EPREG_MASK)

/*******************  Bit definition for USB_EPT0 register  *******************/
#define USB_EPT0_EPTADDR_Pos                (0U)
#define USB_EPT0_EPTADDR_Msk                (0xFU << USB_EPT0_EPTADDR_Pos)          /*!< 0x0000000F */
#define USB_EPT0_EPTADDR                    USB_EPT0_EPTADDR_Msk                    /*!< Endpoint address */

#define USB_EPT0_TXSTS_Pos                  (4U)
#define USB_EPT0_TXSTS_Msk                  (0x3U << USB_EPT0_TXSTS_Pos)            /*!< 0x00000030 */
#define USB_EPT0_TXSTS                      USB_EPT0_TXSTS_Msk                      /*!< TXSTS[1:0] bits (Tx status) */
#define USB_EPT0_TXSTS_0                    (0x1U << USB_EPT0_TXSTS_Pos)            /*!< 0x00000010 */
#define USB_EPT0_TXSTS_1                    (0x2U << USB_EPT0_TXSTS_Pos)            /*!< 0x00000020 */

#define USB_EPT0_TXDTS_Pos                  (6U)
#define USB_EPT0_TXDTS_Msk                  (0x1U << USB_EPT0_TXDTS_Pos)            /*!< 0x00000040 */
#define USB_EPT0_TXDTS                      USB_EPT0_TXDTS_Msk                      /*!< Tx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT0_TXTC_Pos                   (7U)
#define USB_EPT0_TXTC_Msk                   (0x1U << USB_EPT0_TXTC_Pos)             /*!< 0x00000080 */
#define USB_EPT0_TXTC                       USB_EPT0_TXTC_Msk                       /*!< Tx transaction completed */
#define USB_EPT0_EXF_Pos                    (8U)
#define USB_EPT0_EXF_Msk                    (0x1U << USB_EPT0_EXF_Pos)              /*!< 0x00000100 */
#define USB_EPT0_EXF                        USB_EPT0_EXF_Msk                        /*!< Endpoint extend function */

#define USB_EPT0_TRANS_TYPE_Pos             (9U)
#define USB_EPT0_TRANS_TYPE_Msk             (0x3U << USB_EPT0_TRANS_TYPE_Pos)       /*!< 0x00000600 */
#define USB_EPT0_TRANS_TYPE                 USB_EPT0_TRANS_TYPE_Msk                 /*!< TRANS_TYPE[1:0] bits (Transfer type) */
#define USB_EPT0_TRANS_TYPE_0               (0x1U << USB_EPT0_TRANS_TYPE_Pos)       /*!< 0x00000200 */
#define USB_EPT0_TRANS_TYPE_1               (0x2U << USB_EPT0_TRANS_TYPE_Pos)       /*!< 0x00000400 */

#define USB_EPT0_SETUPTC_Pos                (11U)
#define USB_EPT0_SETUPTC_Msk                (0x1U << USB_EPT0_SETUPTC_Pos)          /*!< 0x00000800 */
#define USB_EPT0_SETUPTC                    USB_EPT0_SETUPTC_Msk                    /*!< Setup transaction completed */

#define USB_EPT0_RXSTS_Pos                  (12U)
#define USB_EPT0_RXSTS_Msk                  (0x3U << USB_EPT0_RXSTS_Pos)            /*!< 0x00003000 */
#define USB_EPT0_RXSTS                      USB_EPT0_RXSTS_Msk                      /*!< RXSTS[1:0] bits (Rx status) */
#define USB_EPT0_RXSTS_0                    (0x1U << USB_EPT0_RXSTS_Pos)            /*!< 0x00001000 */
#define USB_EPT0_RXSTS_1                    (0x2U << USB_EPT0_RXSTS_Pos)            /*!< 0x00002000 */

#define USB_EPT0_RXDTS_Pos                  (14U)
#define USB_EPT0_RXDTS_Msk                  (0x1U << USB_EPT0_RXDTS_Pos)            /*!< 0x00004000 */
#define USB_EPT0_RXDTS                      USB_EPT0_RXDTS_Msk                      /*!< Rx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT0_RXTC_Pos                   (15U)
#define USB_EPT0_RXTC_Msk                   (0x1U << USB_EPT0_RXTC_Pos)             /*!< 0x00008000 */
#define USB_EPT0_RXTC                       USB_EPT0_RXTC_Msk                       /*!< Rx transaction completed */

