HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
/******************  Bit definition for USB_T4ADDR register  ******************/
#define USB_T4ADDR_T4ADDR_Pos               (1U)
#define USB_T4ADDR_T4ADDR_Msk               (0x7FFFU << USB_T4ADDR_T4ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_T4ADDR_T4ADDR                   USB_T4ADDR_T4ADDR_Msk                   /*!< Transmission buffer first address 4 */

/******************  Bit definition for USB_T5ADDR register  ******************/
#define USB_T5ADDR_T5ADDR_Pos               (1U)
#define USB_T5ADDR_T5ADDR_Msk               (0x7FFFU << USB_T5ADDR_T5ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_T5ADDR_T5ADDR                   USB_T5ADDR_T5ADDR_Msk                   /*!< Transmission buffer first address 5 */

/******************  Bit definition for USB_T6ADDR register  ******************/
#define USB_T6ADDR_T6ADDR_Pos               (1U)
#define USB_T6ADDR_T6ADDR_Msk               (0x7FFFU << USB_T6ADDR_T6ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_T6ADDR_T6ADDR                   USB_T6ADDR_T6ADDR_Msk                   /*!< Transmission buffer first address 6 */

/******************  Bit definition for USB_T6ADDR register  ******************/
#define USB_T7ADDR_T7ADDR_Pos               (1U)
#define USB_T7ADDR_T7ADDR_Msk               (0x7FFFU << USB_T7ADDR_T7ADDR_Pos)      /*!< 0x0000FFFE */
#define USB_T7ADDR_T7ADDR                   USB_T7ADDR_T7ADDR_Msk                   /*!< Transmission buffer first address 7 */

/*----------------------------------------------------------------------------*/

/******************  Bit definition for USB_T0LEN register  *******************/
#define USB_T0LEN_T0LEN_Pos                 (0U)
#define USB_T0LEN_T0LEN_Msk                 (0x3FFU << USB_T0LEN_T0LEN_Pos)         /*!< 0x000003FF */
#define USB_T0LEN_T0LEN                     USB_T0LEN_T0LEN_Msk                     /*!< Transmission length 0 */

/******************  Bit definition for USB_T1LEN register  *******************/
#define USB_T1LEN_T1LEN_Pos                 (0U)
#define USB_T1LEN_T1LEN_Msk                 (0x3FFU << USB_T1LEN_T1LEN_Pos)         /*!< 0x000003FF */
#define USB_T1LEN_T1LEN                     USB_T1LEN_T1LEN_Msk                     /*!< Transmission length 1 */

/******************  Bit definition for USB_T2LEN register  *******************/
#define USB_T2LEN_T2LEN_Pos                 (0U)
#define USB_T2LEN_T2LEN_Msk                 (0x3FFU << USB_T2LEN_T2LEN_Pos)         /*!< 0x000003FF */
#define USB_T2LEN_T2LEN                     USB_T2LEN_T2LEN_Msk                     /*!< Transmission length 2 */

/******************  Bit definition for USB_T3LEN register  *******************/
#define USB_T3LEN_T3LEN_Pos                 (0U)
#define USB_T3LEN_T3LEN_Msk                 (0x3FFU << USB_T3LEN_T3LEN_Pos)         /*!< 0x000003FF */
#define USB_T3LEN_T3LEN                     USB_T3LEN_T3LEN_Msk                     /*!< Transmission length 3 */

/******************  Bit definition for USB_T4LEN register  *******************/
#define USB_T4LEN_T4LEN_Pos                 (0U)
#define USB_T4LEN_T4LEN_Msk                 (0x3FFU << USB_T4LEN_T4LEN_Pos)         /*!< 0x000003FF */
#define USB_T4LEN_T4LEN                     USB_T4LEN_T4LEN_Msk                     /*!< Transmission length 4 */

/******************  Bit definition for USB_T5LEN register  *******************/
#define USB_T5LEN_T5LEN_Pos                 (0U)
#define USB_T5LEN_T5LEN_Msk                 (0x3FFU << USB_T5LEN_T5LEN_Pos)         /*!< 0x000003FF */
#define USB_T5LEN_T5LEN                     USB_T5LEN_T5LEN_Msk                     /*!< Transmission length 5 */

/******************  Bit definition for USB_T6LEN register  *******************/
#define USB_T6LEN_T6LEN_Pos                 (0U)
#define USB_T6LEN_T6LEN_Msk                 (0x3FFU << USB_T6LEN_T6LEN_Pos)         /*!< 0x000003FF */
#define USB_T6LEN_T6LEN                     USB_T6LEN_T6LEN_Msk                     /*!< Transmission length 6 */

/******************  Bit definition for USB_T7LEN register  *******************/
#define USB_T7LEN_T7LEN_Pos                 (0U)
#define USB_T7LEN_T7LEN_Msk                 (0x3FFU << USB_T7LEN_T7LEN_Pos)         /*!< 0x000003FF */
#define USB_T7LEN_T7LEN                     USB_T7LEN_T7LEN_Msk                     /*!< Transmission length 7 */

/*----------------------------------------------------------------------------*/

/*****************  Bit definition for USB_T0LEN_0 register  ******************/
#define USB_T0LEN_0_T0LEN_0                 0x000003FFU                             /*!< Transmission length 0 (low) */

/*****************  Bit definition for USB_T0LEN_1 register  ******************/
#define USB_T0LEN_1_T0LEN_1                 0x03FF0000U                             /*!< Transmission length 0 (high) */

/*****************  Bit definition for USB_T1LEN_0 register  ******************/
#define USB_T1LEN_0_T1LEN_0                 0x000003FFU                             /*!< Transmission length 1 (low) */

/*****************  Bit definition for USB_T1LEN_1 register  ******************/
#define USB_T1LEN_1_T1LEN_1                 0x03FF0000U                             /*!< Transmission length 1 (high) */

/*****************  Bit definition for USB_T2LEN_0 register  ******************/
#define USB_T2LEN_0_T2LEN_0                 0x000003FFU                             /*!< Transmission length 2 (low) */

/*****************  Bit definition for USB_T2LEN_1 register  ******************/
#define USB_T2LEN_1_T2LEN_1                 0x03FF0000U                             /*!< Transmission length 2 (high) */

/*****************  Bit definition for USB_T3LEN_0 register  ******************/
#define USB_T3LEN_0_T3LEN_0                 0x000003FFU                             /*!< Transmission length 3 (low) */

/*****************  Bit definition for USB_T3LEN_1 register  ******************/
#define USB_T3LEN_1_T3LEN_1                 0x03FF0000U                             /*!< Transmission length 3 (high) */

/*****************  Bit definition for USB_T4LEN_0 register  ******************/
#define USB_T4LEN_0_T4LEN_0                 0x000003FFU                             /*!< Transmission length 4 (low) */

/*****************  Bit definition for USB_T4LEN_1 register  ******************/
#define USB_T4LEN_1_T4LEN_1                 0x03FF0000U                             /*!< Transmission length 4 (high) */

/*****************  Bit definition for USB_T5LEN_0 register  ******************/
#define USB_T5LEN_0_T5LEN_0                 0x000003FFU                             /*!< Transmission length 5 (low) */

/*****************  Bit definition for USB_T5LEN_1 register  ******************/
#define USB_T5LEN_1_T5LEN_1                 0x03FF0000U                             /*!< Transmission length 5 (high) */

/*****************  Bit definition for USB_T6LEN_0 register  ******************/
#define USB_T6LEN_0_T6LEN_0                 0x000003FFU                             /*!< Transmission length 6 (low) */

