HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axc.h
#define IS_TMR_REPETITION_COUNTER_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_CLOCK_DIVISION_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8)    || \
   ((INSTANCE) == TMR9)    || \
   ((INSTANCE) == TMR10)   || \
   ((INSTANCE) == TMR11)   || \
   ((INSTANCE) == TMR12)   || \
   ((INSTANCE) == TMR13)   || \
   ((INSTANCE) == TMR14))

#define IS_TMR_DMA_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR6)    || \
   ((INSTANCE) == TMR7)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_DMA_CC_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_COMMUTATION_EVENT_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_ETR_INSTANCE(INSTANCE)  (((INSTANCE) == TMR1)    || \
                                        ((INSTANCE) == TMR2)    || \
                                        ((INSTANCE) == TMR3)    || \
                                        ((INSTANCE) == TMR4)    || \
                                        ((INSTANCE) == TMR5)    || \
                                        ((INSTANCE) == TMR8))

#define IS_TMR_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == TMR1)    || \
                                                         ((INSTANCE) == TMR2)    || \
                                                         ((INSTANCE) == TMR3)    || \
                                                         ((INSTANCE) == TMR4)    || \
                                                         ((INSTANCE) == TMR5)    || \
                                                         ((INSTANCE) == TMR8))

#define IS_TMR_32B_COUNTER_INSTANCE(INSTANCE)           0U

/***************************** END TMR Instances ******************************/

/********************* USART Instances : Synchronous mode *********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                     ((INSTANCE) == USART2) || \
                                     ((INSTANCE) == USART3) || \
                                     ((INSTANCE) == USART6))

/********************* UART Instances : Asynchronous mode *********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART3) || \
                                    ((INSTANCE) == UART4)  || \
                                    ((INSTANCE) == UART5)  || \
                                    ((INSTANCE) == USART6) || \
                                    ((INSTANCE) == UART7)  || \
                                    ((INSTANCE) == UART8))

/********************* UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                               ((INSTANCE) == USART2) || \
                                               ((INSTANCE) == USART3) || \
                                               ((INSTANCE) == UART4)  || \
                                               ((INSTANCE) == UART5)  || \
                                               ((INSTANCE) == USART6) || \
                                               ((INSTANCE) == UART7)  || \
                                               ((INSTANCE) == UART8))

/************************* UART Instances : LIN mode **************************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                        ((INSTANCE) == USART2) || \
                                        ((INSTANCE) == USART3) || \
                                        ((INSTANCE) == UART4)  || \
                                        ((INSTANCE) == UART5)  || \
                                        ((INSTANCE) == USART6) || \
                                        ((INSTANCE) == UART7)  || \
                                        ((INSTANCE) == UART8))

/******************* UART Instances : Hardware Flow control *******************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == USART3))

/********************* UART Instances : Smard card mode ***********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                         ((INSTANCE) == USART2) || \
                                         ((INSTANCE) == USART3) || \
                                         ((INSTANCE) == USART6))

/************************* UART Instances : IRDA mode *************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART3) || \
                                    ((INSTANCE) == UART4)  || \
                                    ((INSTANCE) == UART5)  || \
                                    ((INSTANCE) == USART6) || \
                                    ((INSTANCE) == UART7)  || \
                                    ((INSTANCE) == UART8))

/******************* UART Instances : Multi-Processor mode ********************/
#define IS_UART_MULTIPROCESSOR_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                   ((INSTANCE) == USART2) || \
                                                   ((INSTANCE) == USART3) || \
                                                   ((INSTANCE) == UART4)  || \
                                                   ((INSTANCE) == UART5)  || \
                                                   ((INSTANCE) == USART6) || \
                                                   ((INSTANCE) == UART7)  || \
                                                   ((INSTANCE) == UART8))

/******************** UART Instances : DMA mode available *********************/
#define IS_UART_DMA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                        ((INSTANCE) == USART2) || \
                                        ((INSTANCE) == USART3) || \
                                        ((INSTANCE) == UART4)  || \
                                        ((INSTANCE) == UART5)  || \
                                        ((INSTANCE) == USART6) || \
                                        ((INSTANCE) == UART7)  || \
                                        ((INSTANCE) == UART8))

/******************************* RTC Instances ********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RTC)

/******************************* WWDT Instances *******************************/
#define IS_WWDT_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDT)

/******************************* USB Instances ********************************/
#define IS_USB_ALL_INSTANCE(INSTANCE)   ((INSTANCE) == USB)

#define CRM_HEXT_MIN        4000000U
#define CRM_HEXT_MAX       25000000U

#define CRM_MAX_FREQUENCY 240000000U

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __AT32F403AxC_H */

/*********************** (C) COPYRIGHT Artery Technologies *****END OF FILE****/
